zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
/** Number of instances of the ENETC_VSI module. */
#define ENETC_VSI_INSTANCE_COUNT                 (5u)

/* ENETC_VSI - Peripheral instance base addresses */
/** Peripheral NETC__ENETC_VSI0 base address */
#define IP_NETC__ENETC_VSI0_BASE                 (0x6D160000u)
/** Peripheral NETC__ENETC_VSI0 base pointer */
#define IP_NETC__ENETC_VSI0                      ((ENETC_VSI_Type *)IP_NETC__ENETC_VSI0_BASE)
/** Peripheral NETC__ENETC_VSI1 base address */
#define IP_NETC__ENETC_VSI1_BASE                 (0x6D170000u)
/** Peripheral NETC__ENETC_VSI1 base pointer */
#define IP_NETC__ENETC_VSI1                      ((ENETC_VSI_Type *)IP_NETC__ENETC_VSI1_BASE)
/** Peripheral NETC__ENETC_VSI2 base address */
#define IP_NETC__ENETC_VSI2_BASE                 (0x6D180000u)
/** Peripheral NETC__ENETC_VSI2 base pointer */
#define IP_NETC__ENETC_VSI2                      ((ENETC_VSI_Type *)IP_NETC__ENETC_VSI2_BASE)
/** Peripheral NETC__ENETC_VSI3 base address */
#define IP_NETC__ENETC_VSI3_BASE                 (0x6D190000u)
/** Peripheral NETC__ENETC_VSI3 base pointer */
#define IP_NETC__ENETC_VSI3                      ((ENETC_VSI_Type *)IP_NETC__ENETC_VSI3_BASE)
/** Peripheral NETC__ENETC_VSI4 base address */
#define IP_NETC__ENETC_VSI4_BASE                 (0x6D1A0000u)
/** Peripheral NETC__ENETC_VSI4 base pointer */
#define IP_NETC__ENETC_VSI4                      ((ENETC_VSI_Type *)IP_NETC__ENETC_VSI4_BASE)
/** Array initializer of ENETC_VSI peripheral base addresses */
#define IP_ENETC_VSI_BASE_ADDRS                  { IP_NETC__ENETC_VSI0_BASE, IP_NETC__ENETC_VSI1_BASE, IP_NETC__ENETC_VSI2_BASE, IP_NETC__ENETC_VSI3_BASE, IP_NETC__ENETC_VSI4_BASE }
/** Array initializer of ENETC_VSI peripheral base pointers */
#define IP_ENETC_VSI_BASE_PTRS                   { IP_NETC__ENETC_VSI0, IP_NETC__ENETC_VSI1, IP_NETC__ENETC_VSI2, IP_NETC__ENETC_VSI3, IP_NETC__ENETC_VSI4 }

/* ----------------------------------------------------------------------------
   -- ENETC_VSI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_VSI_Register_Masks ENETC_VSI Register Masks
 * @{
 */

/*! @name SIMR - Station interface mode register */
/*! @{ */

#define ENETC_VSI_SIMR_RSSE_MASK                 (0x1U)
#define ENETC_VSI_SIMR_RSSE_SHIFT                (0U)
#define ENETC_VSI_SIMR_RSSE_WIDTH                (1U)
#define ENETC_VSI_SIMR_RSSE(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_RSSE_SHIFT)) & ENETC_VSI_SIMR_RSSE_MASK)

#define ENETC_VSI_SIMR_RNUM_MASK                 (0x2U)
#define ENETC_VSI_SIMR_RNUM_SHIFT                (1U)
#define ENETC_VSI_SIMR_RNUM_WIDTH                (1U)
#define ENETC_VSI_SIMR_RNUM(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_RNUM_SHIFT)) & ENETC_VSI_SIMR_RNUM_MASK)

#define ENETC_VSI_SIMR_RNMM_MASK                 (0x4U)
#define ENETC_VSI_SIMR_RNMM_SHIFT                (2U)
#define ENETC_VSI_SIMR_RNMM_WIDTH                (1U)
#define ENETC_VSI_SIMR_RNMM(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_RNMM_SHIFT)) & ENETC_VSI_SIMR_RNMM_MASK)

#define ENETC_VSI_SIMR_RNBM_MASK                 (0x8U)
#define ENETC_VSI_SIMR_RNBM_SHIFT                (3U)
#define ENETC_VSI_SIMR_RNBM_WIDTH                (1U)
#define ENETC_VSI_SIMR_RNBM(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_RNBM_SHIFT)) & ENETC_VSI_SIMR_RNBM_MASK)

#define ENETC_VSI_SIMR_V2IPVE_MASK               (0x10U)
#define ENETC_VSI_SIMR_V2IPVE_SHIFT              (4U)
#define ENETC_VSI_SIMR_V2IPVE_WIDTH              (1U)
#define ENETC_VSI_SIMR_V2IPVE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_V2IPVE_SHIFT)) & ENETC_VSI_SIMR_V2IPVE_MASK)

#define ENETC_VSI_SIMR_DEFAULT_RX_GROUP_MASK     (0x10000U)
#define ENETC_VSI_SIMR_DEFAULT_RX_GROUP_SHIFT    (16U)
#define ENETC_VSI_SIMR_DEFAULT_RX_GROUP_WIDTH    (1U)
#define ENETC_VSI_SIMR_DEFAULT_RX_GROUP(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_DEFAULT_RX_GROUP_SHIFT)) & ENETC_VSI_SIMR_DEFAULT_RX_GROUP_MASK)

#define ENETC_VSI_SIMR_EN_MASK                   (0x80000000U)
#define ENETC_VSI_SIMR_EN_SHIFT                  (31U)
#define ENETC_VSI_SIMR_EN_WIDTH                  (1U)
#define ENETC_VSI_SIMR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMR_EN_SHIFT)) & ENETC_VSI_SIMR_EN_MASK)
/*! @} */

/*! @name SISR - Station interface status register */
/*! @{ */

#define ENETC_VSI_SISR_TX_BUSY_MASK              (0x1U)
#define ENETC_VSI_SISR_TX_BUSY_SHIFT             (0U)
#define ENETC_VSI_SISR_TX_BUSY_WIDTH             (1U)
#define ENETC_VSI_SISR_TX_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SISR_TX_BUSY_SHIFT)) & ENETC_VSI_SISR_TX_BUSY_MASK)

#define ENETC_VSI_SISR_MAC_UP_MASK               (0x2U)
#define ENETC_VSI_SISR_MAC_UP_SHIFT              (1U)
#define ENETC_VSI_SISR_MAC_UP_WIDTH              (1U)
#define ENETC_VSI_SISR_MAC_UP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SISR_MAC_UP_SHIFT)) & ENETC_VSI_SISR_MAC_UP_MASK)

#define ENETC_VSI_SISR_MAC_MP_MASK               (0x4U)
#define ENETC_VSI_SISR_MAC_MP_SHIFT              (2U)
#define ENETC_VSI_SISR_MAC_MP_WIDTH              (1U)
#define ENETC_VSI_SISR_MAC_MP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SISR_MAC_MP_SHIFT)) & ENETC_VSI_SISR_MAC_MP_MASK)

#define ENETC_VSI_SISR_VLAN_P_MASK               (0x8U)
#define ENETC_VSI_SISR_VLAN_P_SHIFT              (3U)
#define ENETC_VSI_SISR_VLAN_P_WIDTH              (1U)
#define ENETC_VSI_SISR_VLAN_P(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SISR_VLAN_P_SHIFT)) & ENETC_VSI_SISR_VLAN_P_MASK)

#define ENETC_VSI_SISR_VLAN_UTA_MASK             (0x10U)
#define ENETC_VSI_SISR_VLAN_UTA_SHIFT            (4U)
#define ENETC_VSI_SISR_VLAN_UTA_WIDTH            (1U)
#define ENETC_VSI_SISR_VLAN_UTA(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SISR_VLAN_UTA_SHIFT)) & ENETC_VSI_SISR_VLAN_UTA_MASK)
/*! @} */

/*! @name SICTR0 - Station interface current time register 0 */
/*! @{ */

