zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SICTR0_CURR_TIME_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SICTR0_CURR_TIME_SHIFT         (0U)
#define ENETC_VSI_SICTR0_CURR_TIME_WIDTH         (32U)
#define ENETC_VSI_SICTR0_CURR_TIME(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICTR0_CURR_TIME_SHIFT)) & ENETC_VSI_SICTR0_CURR_TIME_MASK)
/*! @} */

/*! @name SICTR1 - Station interface current time register 1 */
/*! @{ */

#define ENETC_VSI_SICTR1_CURR_TIME_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SICTR1_CURR_TIME_SHIFT         (0U)
#define ENETC_VSI_SICTR1_CURR_TIME_WIDTH         (32U)
#define ENETC_VSI_SICTR1_CURR_TIME(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICTR1_CURR_TIME_SHIFT)) & ENETC_VSI_SICTR1_CURR_TIME_MASK)
/*! @} */

/*! @name SIPCAPR0 - Station interface port capability register 0 */
/*! @{ */

#define ENETC_VSI_SIPCAPR0_RSC_MASK              (0x1U)
#define ENETC_VSI_SIPCAPR0_RSC_SHIFT             (0U)
#define ENETC_VSI_SIPCAPR0_RSC_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_RSC(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_RSC_SHIFT)) & ENETC_VSI_SIPCAPR0_RSC_MASK)

#define ENETC_VSI_SIPCAPR0_LSO_MASK              (0x2U)
#define ENETC_VSI_SIPCAPR0_LSO_SHIFT             (1U)
#define ENETC_VSI_SIPCAPR0_LSO_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_LSO(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_LSO_SHIFT)) & ENETC_VSI_SIPCAPR0_LSO_MASK)

#define ENETC_VSI_SIPCAPR0_RFS_MASK              (0x4U)
#define ENETC_VSI_SIPCAPR0_RFS_SHIFT             (2U)
#define ENETC_VSI_SIPCAPR0_RFS_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_RFS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_RFS_SHIFT)) & ENETC_VSI_SIPCAPR0_RFS_MASK)

#define ENETC_VSI_SIPCAPR0_FP_MASK               (0x8U)
#define ENETC_VSI_SIPCAPR0_FP_SHIFT              (3U)
#define ENETC_VSI_SIPCAPR0_FP_WIDTH              (1U)
#define ENETC_VSI_SIPCAPR0_FP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_FP_SHIFT)) & ENETC_VSI_SIPCAPR0_FP_MASK)

#define ENETC_VSI_SIPCAPR0_TGS_MASK              (0x10U)
#define ENETC_VSI_SIPCAPR0_TGS_SHIFT             (4U)
#define ENETC_VSI_SIPCAPR0_TGS_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_TGS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_TGS_SHIFT)) & ENETC_VSI_SIPCAPR0_TGS_MASK)

#define ENETC_VSI_SIPCAPR0_TSD_MASK              (0x20U)
#define ENETC_VSI_SIPCAPR0_TSD_SHIFT             (5U)
#define ENETC_VSI_SIPCAPR0_TSD_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_TSD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_TSD_SHIFT)) & ENETC_VSI_SIPCAPR0_TSD_MASK)

#define ENETC_VSI_SIPCAPR0_CBS_MASK              (0x40U)
#define ENETC_VSI_SIPCAPR0_CBS_SHIFT             (6U)
#define ENETC_VSI_SIPCAPR0_CBS_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_CBS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_CBS_SHIFT)) & ENETC_VSI_SIPCAPR0_CBS_MASK)

#define ENETC_VSI_SIPCAPR0_RSS_MASK              (0x100U)
#define ENETC_VSI_SIPCAPR0_RSS_SHIFT             (8U)
#define ENETC_VSI_SIPCAPR0_RSS_WIDTH             (1U)
#define ENETC_VSI_SIPCAPR0_RSS(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_RSS_SHIFT)) & ENETC_VSI_SIPCAPR0_RSS_MASK)

#define ENETC_VSI_SIPCAPR0_PSFP_MASK             (0x200U)
#define ENETC_VSI_SIPCAPR0_PSFP_SHIFT            (9U)
#define ENETC_VSI_SIPCAPR0_PSFP_WIDTH            (1U)
#define ENETC_VSI_SIPCAPR0_PSFP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_PSFP_SHIFT)) & ENETC_VSI_SIPCAPR0_PSFP_MASK)

#define ENETC_VSI_SIPCAPR0_IPFLT_MASK            (0x400U)
#define ENETC_VSI_SIPCAPR0_IPFLT_SHIFT           (10U)
#define ENETC_VSI_SIPCAPR0_IPFLT_WIDTH           (1U)
#define ENETC_VSI_SIPCAPR0_IPFLT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_IPFLT_SHIFT)) & ENETC_VSI_SIPCAPR0_IPFLT_MASK)

#define ENETC_VSI_SIPCAPR0_RP_MASK               (0x800U)
#define ENETC_VSI_SIPCAPR0_RP_SHIFT              (11U)
#define ENETC_VSI_SIPCAPR0_RP_WIDTH              (1U)
#define ENETC_VSI_SIPCAPR0_RP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_RP_SHIFT)) & ENETC_VSI_SIPCAPR0_RP_MASK)

#define ENETC_VSI_SIPCAPR0_FS_MASK               (0x10000U)
#define ENETC_VSI_SIPCAPR0_FS_SHIFT              (16U)
#define ENETC_VSI_SIPCAPR0_FS_WIDTH              (1U)
#define ENETC_VSI_SIPCAPR0_FS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR0_FS_SHIFT)) & ENETC_VSI_SIPCAPR0_FS_MASK)
/*! @} */

/*! @name SIPCAPR1 - Station interface port capability register 1 */
/*! @{ */

#define ENETC_VSI_SIPCAPR1_NUM_TCS_MASK          (0x70U)
#define ENETC_VSI_SIPCAPR1_NUM_TCS_SHIFT         (4U)
#define ENETC_VSI_SIPCAPR1_NUM_TCS_WIDTH         (3U)
#define ENETC_VSI_SIPCAPR1_NUM_TCS(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR1_NUM_TCS_SHIFT)) & ENETC_VSI_SIPCAPR1_NUM_TCS_MASK)

#define ENETC_VSI_SIPCAPR1_NUM_MCH_MASK          (0x300U)
#define ENETC_VSI_SIPCAPR1_NUM_MCH_SHIFT         (8U)
#define ENETC_VSI_SIPCAPR1_NUM_MCH_WIDTH         (2U)
#define ENETC_VSI_SIPCAPR1_NUM_MCH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR1_NUM_MCH_SHIFT)) & ENETC_VSI_SIPCAPR1_NUM_MCH_MASK)

#define ENETC_VSI_SIPCAPR1_NUM_UCH_MASK          (0xC00U)
#define ENETC_VSI_SIPCAPR1_NUM_UCH_SHIFT         (10U)
#define ENETC_VSI_SIPCAPR1_NUM_UCH_WIDTH         (2U)
#define ENETC_VSI_SIPCAPR1_NUM_UCH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR1_NUM_UCH_SHIFT)) & ENETC_VSI_SIPCAPR1_NUM_UCH_MASK)

#define ENETC_VSI_SIPCAPR1_NUM_MSIX_MASK         (0x3F000U)
#define ENETC_VSI_SIPCAPR1_NUM_MSIX_SHIFT        (12U)
#define ENETC_VSI_SIPCAPR1_NUM_MSIX_WIDTH        (6U)
#define ENETC_VSI_SIPCAPR1_NUM_MSIX(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR1_NUM_MSIX_SHIFT)) & ENETC_VSI_SIPCAPR1_NUM_MSIX_MASK)

#define ENETC_VSI_SIPCAPR1_NUM_IPV_MASK          (0x80000000U)
#define ENETC_VSI_SIPCAPR1_NUM_IPV_SHIFT         (31U)
#define ENETC_VSI_SIPCAPR1_NUM_IPV_WIDTH         (1U)
#define ENETC_VSI_SIPCAPR1_NUM_IPV(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPCAPR1_NUM_IPV_SHIFT)) & ENETC_VSI_SIPCAPR1_NUM_IPV_MASK)
/*! @} */

/*! @name SITSR - Station interface timer status register */
/*! @{ */

#define ENETC_VSI_SITSR_SYNC_MASK                (0x1U)
#define ENETC_VSI_SITSR_SYNC_SHIFT               (0U)
#define ENETC_VSI_SITSR_SYNC_WIDTH               (1U)
#define ENETC_VSI_SITSR_SYNC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITSR_SYNC_SHIFT)) & ENETC_VSI_SITSR_SYNC_MASK)

