zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SITSR_PARAM_VAL_MASK           (0xFFFFFFFEU)
#define ENETC_VSI_SITSR_PARAM_VAL_SHIFT          (1U)
#define ENETC_VSI_SITSR_PARAM_VAL_WIDTH          (31U)
#define ENETC_VSI_SITSR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITSR_PARAM_VAL_SHIFT)) & ENETC_VSI_SITSR_PARAM_VAL_MASK)
/*! @} */

/*! @name SIRBGCR - Station interface receive BDR group control register */
/*! @{ */

#define ENETC_VSI_SIRBGCR_NUM_GROUPS_MASK        (0x3U)
#define ENETC_VSI_SIRBGCR_NUM_GROUPS_SHIFT       (0U)
#define ENETC_VSI_SIRBGCR_NUM_GROUPS_WIDTH       (2U)
#define ENETC_VSI_SIRBGCR_NUM_GROUPS(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRBGCR_NUM_GROUPS_SHIFT)) & ENETC_VSI_SIRBGCR_NUM_GROUPS_MASK)

#define ENETC_VSI_SIRBGCR_RINGS_PER_GROUP_MASK   (0x70000U)
#define ENETC_VSI_SIRBGCR_RINGS_PER_GROUP_SHIFT  (16U)
#define ENETC_VSI_SIRBGCR_RINGS_PER_GROUP_WIDTH  (3U)
#define ENETC_VSI_SIRBGCR_RINGS_PER_GROUP(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRBGCR_RINGS_PER_GROUP_SHIFT)) & ENETC_VSI_SIRBGCR_RINGS_PER_GROUP_MASK)
/*! @} */

/*! @name SIBCAR - Station interface buffer cache attribute register */
/*! @{ */

#define ENETC_VSI_SIBCAR_BD_WRCACHE_MASK         (0xFU)
#define ENETC_VSI_SIBCAR_BD_WRCACHE_SHIFT        (0U)
#define ENETC_VSI_SIBCAR_BD_WRCACHE_WIDTH        (4U)
#define ENETC_VSI_SIBCAR_BD_WRCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_BD_WRCACHE_SHIFT)) & ENETC_VSI_SIBCAR_BD_WRCACHE_MASK)

#define ENETC_VSI_SIBCAR_BD_WRDOMAIN_MASK        (0x30U)
#define ENETC_VSI_SIBCAR_BD_WRDOMAIN_SHIFT       (4U)
#define ENETC_VSI_SIBCAR_BD_WRDOMAIN_WIDTH       (2U)
#define ENETC_VSI_SIBCAR_BD_WRDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_BD_WRDOMAIN_SHIFT)) & ENETC_VSI_SIBCAR_BD_WRDOMAIN_MASK)

#define ENETC_VSI_SIBCAR_BD_WRSNP_MASK           (0xC0U)
#define ENETC_VSI_SIBCAR_BD_WRSNP_SHIFT          (6U)
#define ENETC_VSI_SIBCAR_BD_WRSNP_WIDTH          (2U)
#define ENETC_VSI_SIBCAR_BD_WRSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_BD_WRSNP_SHIFT)) & ENETC_VSI_SIBCAR_BD_WRSNP_MASK)

#define ENETC_VSI_SIBCAR_WRCACHE_MASK            (0xF00U)
#define ENETC_VSI_SIBCAR_WRCACHE_SHIFT           (8U)
#define ENETC_VSI_SIBCAR_WRCACHE_WIDTH           (4U)
#define ENETC_VSI_SIBCAR_WRCACHE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_WRCACHE_SHIFT)) & ENETC_VSI_SIBCAR_WRCACHE_MASK)

#define ENETC_VSI_SIBCAR_WRDOMAIN_MASK           (0x3000U)
#define ENETC_VSI_SIBCAR_WRDOMAIN_SHIFT          (12U)
#define ENETC_VSI_SIBCAR_WRDOMAIN_WIDTH          (2U)
#define ENETC_VSI_SIBCAR_WRDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_WRDOMAIN_SHIFT)) & ENETC_VSI_SIBCAR_WRDOMAIN_MASK)

#define ENETC_VSI_SIBCAR_WRSNP_MASK              (0xC000U)
#define ENETC_VSI_SIBCAR_WRSNP_SHIFT             (14U)
#define ENETC_VSI_SIBCAR_WRSNP_WIDTH             (2U)
#define ENETC_VSI_SIBCAR_WRSNP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_WRSNP_SHIFT)) & ENETC_VSI_SIBCAR_WRSNP_MASK)

#define ENETC_VSI_SIBCAR_BD_RDCACHE_MASK         (0xF0000U)
#define ENETC_VSI_SIBCAR_BD_RDCACHE_SHIFT        (16U)
#define ENETC_VSI_SIBCAR_BD_RDCACHE_WIDTH        (4U)
#define ENETC_VSI_SIBCAR_BD_RDCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_BD_RDCACHE_SHIFT)) & ENETC_VSI_SIBCAR_BD_RDCACHE_MASK)

#define ENETC_VSI_SIBCAR_BD_RDDOMAIN_MASK        (0x300000U)
#define ENETC_VSI_SIBCAR_BD_RDDOMAIN_SHIFT       (20U)
#define ENETC_VSI_SIBCAR_BD_RDDOMAIN_WIDTH       (2U)
#define ENETC_VSI_SIBCAR_BD_RDDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_BD_RDDOMAIN_SHIFT)) & ENETC_VSI_SIBCAR_BD_RDDOMAIN_MASK)

#define ENETC_VSI_SIBCAR_BD_RDSNP_MASK           (0xC00000U)
#define ENETC_VSI_SIBCAR_BD_RDSNP_SHIFT          (22U)
#define ENETC_VSI_SIBCAR_BD_RDSNP_WIDTH          (2U)
#define ENETC_VSI_SIBCAR_BD_RDSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_BD_RDSNP_SHIFT)) & ENETC_VSI_SIBCAR_BD_RDSNP_MASK)

#define ENETC_VSI_SIBCAR_RDCACHE_MASK            (0xF000000U)
#define ENETC_VSI_SIBCAR_RDCACHE_SHIFT           (24U)
#define ENETC_VSI_SIBCAR_RDCACHE_WIDTH           (4U)
#define ENETC_VSI_SIBCAR_RDCACHE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_RDCACHE_SHIFT)) & ENETC_VSI_SIBCAR_RDCACHE_MASK)

#define ENETC_VSI_SIBCAR_RDDOMAIN_MASK           (0x30000000U)
#define ENETC_VSI_SIBCAR_RDDOMAIN_SHIFT          (28U)
#define ENETC_VSI_SIBCAR_RDDOMAIN_WIDTH          (2U)
#define ENETC_VSI_SIBCAR_RDDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_RDDOMAIN_SHIFT)) & ENETC_VSI_SIBCAR_RDDOMAIN_MASK)

#define ENETC_VSI_SIBCAR_RDSNP_MASK              (0xC0000000U)
#define ENETC_VSI_SIBCAR_RDSNP_SHIFT             (30U)
#define ENETC_VSI_SIBCAR_RDSNP_WIDTH             (2U)
#define ENETC_VSI_SIBCAR_RDSNP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBCAR_RDSNP_SHIFT)) & ENETC_VSI_SIBCAR_RDSNP_MASK)
/*! @} */

/*! @name SICCAR - Station interface command cache attribute register */
/*! @{ */

#define ENETC_VSI_SICCAR_CBD_WRCACHE_MASK        (0xFU)
#define ENETC_VSI_SICCAR_CBD_WRCACHE_SHIFT       (0U)
#define ENETC_VSI_SICCAR_CBD_WRCACHE_WIDTH       (4U)
#define ENETC_VSI_SICCAR_CBD_WRCACHE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CBD_WRCACHE_SHIFT)) & ENETC_VSI_SICCAR_CBD_WRCACHE_MASK)

#define ENETC_VSI_SICCAR_CBD_WRDOMAIN_MASK       (0x30U)
#define ENETC_VSI_SICCAR_CBD_WRDOMAIN_SHIFT      (4U)
#define ENETC_VSI_SICCAR_CBD_WRDOMAIN_WIDTH      (2U)
#define ENETC_VSI_SICCAR_CBD_WRDOMAIN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CBD_WRDOMAIN_SHIFT)) & ENETC_VSI_SICCAR_CBD_WRDOMAIN_MASK)

#define ENETC_VSI_SICCAR_CBD_WRSNP_MASK          (0xC0U)
#define ENETC_VSI_SICCAR_CBD_WRSNP_SHIFT         (6U)
#define ENETC_VSI_SICCAR_CBD_WRSNP_WIDTH         (2U)
#define ENETC_VSI_SICCAR_CBD_WRSNP(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CBD_WRSNP_SHIFT)) & ENETC_VSI_SICCAR_CBD_WRSNP_MASK)

#define ENETC_VSI_SICCAR_CWRCACHE_MASK           (0xF00U)
#define ENETC_VSI_SICCAR_CWRCACHE_SHIFT          (8U)
#define ENETC_VSI_SICCAR_CWRCACHE_WIDTH          (4U)
#define ENETC_VSI_SICCAR_CWRCACHE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CWRCACHE_SHIFT)) & ENETC_VSI_SICCAR_CWRCACHE_MASK)

