zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SICCAR_CWRDOMAIN_MASK          (0x3000U)
#define ENETC_VSI_SICCAR_CWRDOMAIN_SHIFT         (12U)
#define ENETC_VSI_SICCAR_CWRDOMAIN_WIDTH         (2U)
#define ENETC_VSI_SICCAR_CWRDOMAIN(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CWRDOMAIN_SHIFT)) & ENETC_VSI_SICCAR_CWRDOMAIN_MASK)

#define ENETC_VSI_SICCAR_CWRSNP_MASK             (0xC000U)
#define ENETC_VSI_SICCAR_CWRSNP_SHIFT            (14U)
#define ENETC_VSI_SICCAR_CWRSNP_WIDTH            (2U)
#define ENETC_VSI_SICCAR_CWRSNP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CWRSNP_SHIFT)) & ENETC_VSI_SICCAR_CWRSNP_MASK)

#define ENETC_VSI_SICCAR_CBD_RDCACHE_MASK        (0xF0000U)
#define ENETC_VSI_SICCAR_CBD_RDCACHE_SHIFT       (16U)
#define ENETC_VSI_SICCAR_CBD_RDCACHE_WIDTH       (4U)
#define ENETC_VSI_SICCAR_CBD_RDCACHE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CBD_RDCACHE_SHIFT)) & ENETC_VSI_SICCAR_CBD_RDCACHE_MASK)

#define ENETC_VSI_SICCAR_CBD_RDDOMAIN_MASK       (0x300000U)
#define ENETC_VSI_SICCAR_CBD_RDDOMAIN_SHIFT      (20U)
#define ENETC_VSI_SICCAR_CBD_RDDOMAIN_WIDTH      (2U)
#define ENETC_VSI_SICCAR_CBD_RDDOMAIN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CBD_RDDOMAIN_SHIFT)) & ENETC_VSI_SICCAR_CBD_RDDOMAIN_MASK)

#define ENETC_VSI_SICCAR_CBD_RDSNP_MASK          (0xC00000U)
#define ENETC_VSI_SICCAR_CBD_RDSNP_SHIFT         (22U)
#define ENETC_VSI_SICCAR_CBD_RDSNP_WIDTH         (2U)
#define ENETC_VSI_SICCAR_CBD_RDSNP(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CBD_RDSNP_SHIFT)) & ENETC_VSI_SICCAR_CBD_RDSNP_MASK)

#define ENETC_VSI_SICCAR_CRDCACHE_MASK           (0xF000000U)
#define ENETC_VSI_SICCAR_CRDCACHE_SHIFT          (24U)
#define ENETC_VSI_SICCAR_CRDCACHE_WIDTH          (4U)
#define ENETC_VSI_SICCAR_CRDCACHE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CRDCACHE_SHIFT)) & ENETC_VSI_SICCAR_CRDCACHE_MASK)

#define ENETC_VSI_SICCAR_CRDDOMAIN_MASK          (0x30000000U)
#define ENETC_VSI_SICCAR_CRDDOMAIN_SHIFT         (28U)
#define ENETC_VSI_SICCAR_CRDDOMAIN_WIDTH         (2U)
#define ENETC_VSI_SICCAR_CRDDOMAIN(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CRDDOMAIN_SHIFT)) & ENETC_VSI_SICCAR_CRDDOMAIN_MASK)

#define ENETC_VSI_SICCAR_CRDSNP_MASK             (0xC0000000U)
#define ENETC_VSI_SICCAR_CRDSNP_SHIFT            (30U)
#define ENETC_VSI_SICCAR_CRDSNP_WIDTH            (2U)
#define ENETC_VSI_SICCAR_CRDSNP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICCAR_CRDSNP_SHIFT)) & ENETC_VSI_SICCAR_CRDSNP_MASK)
/*! @} */

/*! @name SIPMAR0 - Station interface primary MAC address register 0 */
/*! @{ */

#define ENETC_VSI_SIPMAR0_PRIM_MAC_ADDR_MASK     (0xFFFFFFFFU)
#define ENETC_VSI_SIPMAR0_PRIM_MAC_ADDR_SHIFT    (0U)
#define ENETC_VSI_SIPMAR0_PRIM_MAC_ADDR_WIDTH    (32U)
#define ENETC_VSI_SIPMAR0_PRIM_MAC_ADDR(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPMAR0_PRIM_MAC_ADDR_SHIFT)) & ENETC_VSI_SIPMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name SIPMAR1 - Station interface primary MAC address register 1 */
/*! @{ */

#define ENETC_VSI_SIPMAR1_PRIM_MAC_ADDR_MASK     (0xFFFFU)
#define ENETC_VSI_SIPMAR1_PRIM_MAC_ADDR_SHIFT    (0U)
#define ENETC_VSI_SIPMAR1_PRIM_MAC_ADDR_WIDTH    (16U)
#define ENETC_VSI_SIPMAR1_PRIM_MAC_ADDR(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIPMAR1_PRIM_MAC_ADDR_SHIFT)) & ENETC_VSI_SIPMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name SICVLANR1 - Station interface custom VLAN register 1 */
/*! @{ */

#define ENETC_VSI_SICVLANR1_ETYPE_MASK           (0xFFFFU)
#define ENETC_VSI_SICVLANR1_ETYPE_SHIFT          (0U)
#define ENETC_VSI_SICVLANR1_ETYPE_WIDTH          (16U)
#define ENETC_VSI_SICVLANR1_ETYPE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICVLANR1_ETYPE_SHIFT)) & ENETC_VSI_SICVLANR1_ETYPE_MASK)

#define ENETC_VSI_SICVLANR1_V_MASK               (0x80000000U)
#define ENETC_VSI_SICVLANR1_V_SHIFT              (31U)
#define ENETC_VSI_SICVLANR1_V_WIDTH              (1U)
#define ENETC_VSI_SICVLANR1_V(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICVLANR1_V_SHIFT)) & ENETC_VSI_SICVLANR1_V_MASK)
/*! @} */

/*! @name SICVLANR2 - Station interface custom VLAN register 2 */
/*! @{ */

#define ENETC_VSI_SICVLANR2_ETYPE_MASK           (0xFFFFU)
#define ENETC_VSI_SICVLANR2_ETYPE_SHIFT          (0U)
#define ENETC_VSI_SICVLANR2_ETYPE_WIDTH          (16U)
#define ENETC_VSI_SICVLANR2_ETYPE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICVLANR2_ETYPE_SHIFT)) & ENETC_VSI_SICVLANR2_ETYPE_MASK)

#define ENETC_VSI_SICVLANR2_V_MASK               (0x80000000U)
#define ENETC_VSI_SICVLANR2_V_SHIFT              (31U)
#define ENETC_VSI_SICVLANR2_V_WIDTH              (1U)
#define ENETC_VSI_SICVLANR2_V(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICVLANR2_V_SHIFT)) & ENETC_VSI_SICVLANR2_V_MASK)
/*! @} */

/*! @name SIVLANIPVMR0 - Station interface VLAN to IPV mapping register 0 */
/*! @{ */

#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_0_MASK    (0xFU)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_0_SHIFT   (0U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_0_WIDTH   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_0(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVLANIPVMR0_PCP_DEI_0_SHIFT)) & ENETC_VSI_SIVLANIPVMR0_PCP_DEI_0_MASK)

#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_1_MASK    (0xF0U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_1_SHIFT   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_1_WIDTH   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_1(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVLANIPVMR0_PCP_DEI_1_SHIFT)) & ENETC_VSI_SIVLANIPVMR0_PCP_DEI_1_MASK)

#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_2_MASK    (0xF00U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_2_SHIFT   (8U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_2_WIDTH   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_2(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVLANIPVMR0_PCP_DEI_2_SHIFT)) & ENETC_VSI_SIVLANIPVMR0_PCP_DEI_2_MASK)

#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_3_MASK    (0xF000U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_3_SHIFT   (12U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_3_WIDTH   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_3(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVLANIPVMR0_PCP_DEI_3_SHIFT)) & ENETC_VSI_SIVLANIPVMR0_PCP_DEI_3_MASK)

#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_4_MASK    (0xF0000U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_4_SHIFT   (16U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_4_WIDTH   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_4(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVLANIPVMR0_PCP_DEI_4_SHIFT)) & ENETC_VSI_SIVLANIPVMR0_PCP_DEI_4_MASK)

#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_5_MASK    (0xF00000U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_5_SHIFT   (20U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_5_WIDTH   (4U)
#define ENETC_VSI_SIVLANIPVMR0_PCP_DEI_5(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVLANIPVMR0_PCP_DEI_5_SHIFT)) & ENETC_VSI_SIVLANIPVMR0_PCP_DEI_5_MASK)

