zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
/*! @name SITOCT0 - Station interface transmit octets counter (ifOutOctets) 0 */
/*! @{ */

#define ENETC_VSI_SITOCT0_TOCT_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SITOCT0_TOCT_LOW_SHIFT         (0U)
#define ENETC_VSI_SITOCT0_TOCT_LOW_WIDTH         (32U)
#define ENETC_VSI_SITOCT0_TOCT_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITOCT0_TOCT_LOW_SHIFT)) & ENETC_VSI_SITOCT0_TOCT_LOW_MASK)
/*! @} */

/*! @name SITOCT1 - Station interface transmit octets counter (ifOutOctets) 1 */
/*! @{ */

#define ENETC_VSI_SITOCT1_TOCT_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_VSI_SITOCT1_TOCT_HIGH_SHIFT        (0U)
#define ENETC_VSI_SITOCT1_TOCT_HIGH_WIDTH        (32U)
#define ENETC_VSI_SITOCT1_TOCT_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITOCT1_TOCT_HIGH_SHIFT)) & ENETC_VSI_SITOCT1_TOCT_HIGH_MASK)
/*! @} */

/*! @name SITFRM0 - Station interface transmit frame counter (aFrameTransmittedOK) 0 */
/*! @{ */

#define ENETC_VSI_SITFRM0_TFRM_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SITFRM0_TFRM_LOW_SHIFT         (0U)
#define ENETC_VSI_SITFRM0_TFRM_LOW_WIDTH         (32U)
#define ENETC_VSI_SITFRM0_TFRM_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITFRM0_TFRM_LOW_SHIFT)) & ENETC_VSI_SITFRM0_TFRM_LOW_MASK)
/*! @} */

/*! @name SITFRM1 - Station interface transmit frame counter (aFrameTransmittedOK) 1 */
/*! @{ */

#define ENETC_VSI_SITFRM1_TFRM_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_VSI_SITFRM1_TFRM_HIGH_SHIFT        (0U)
#define ENETC_VSI_SITFRM1_TFRM_HIGH_WIDTH        (32U)
#define ENETC_VSI_SITFRM1_TFRM_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITFRM1_TFRM_HIGH_SHIFT)) & ENETC_VSI_SITFRM1_TFRM_HIGH_MASK)
/*! @} */

/*! @name SITUCA0 - Station interface transmit unicast frame counter (ifOutUcastPkts) 0 */
/*! @{ */

#define ENETC_VSI_SITUCA0_TUCA_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SITUCA0_TUCA_LOW_SHIFT         (0U)
#define ENETC_VSI_SITUCA0_TUCA_LOW_WIDTH         (32U)
#define ENETC_VSI_SITUCA0_TUCA_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITUCA0_TUCA_LOW_SHIFT)) & ENETC_VSI_SITUCA0_TUCA_LOW_MASK)
/*! @} */

/*! @name SITUCA1 - Station interface transmit unicast frame counter (ifOutUcastPkts) 1 */
/*! @{ */

#define ENETC_VSI_SITUCA1_TUCA_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_VSI_SITUCA1_TUCA_HIGH_SHIFT        (0U)
#define ENETC_VSI_SITUCA1_TUCA_HIGH_WIDTH        (32U)
#define ENETC_VSI_SITUCA1_TUCA_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITUCA1_TUCA_HIGH_SHIFT)) & ENETC_VSI_SITUCA1_TUCA_HIGH_MASK)
/*! @} */

/*! @name SITMCA0 - Station interface transmit multicast frame counter (ifOutMulticastPkts) 0 */
/*! @{ */

#define ENETC_VSI_SITMCA0_TMCA_LOW_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SITMCA0_TMCA_LOW_SHIFT         (0U)
#define ENETC_VSI_SITMCA0_TMCA_LOW_WIDTH         (32U)
#define ENETC_VSI_SITMCA0_TMCA_LOW(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITMCA0_TMCA_LOW_SHIFT)) & ENETC_VSI_SITMCA0_TMCA_LOW_MASK)
/*! @} */

/*! @name SITMCA1 - Station interface transmit multicast frame counter (ifOutMulticastPkts) 1 */
/*! @{ */

#define ENETC_VSI_SITMCA1_TMCA_HIGH_MASK         (0xFFFFFFFFU)
#define ENETC_VSI_SITMCA1_TMCA_HIGH_SHIFT        (0U)
#define ENETC_VSI_SITMCA1_TMCA_HIGH_WIDTH        (32U)
#define ENETC_VSI_SITMCA1_TMCA_HIGH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITMCA1_TMCA_HIGH_SHIFT)) & ENETC_VSI_SITMCA1_TMCA_HIGH_MASK)
/*! @} */

/*! @name SITDFCR - Station interface transmit discard frame counter */
/*! @{ */

#define ENETC_VSI_SITDFCR_COUNT_MASK             (0xFFFFFFFFU)
#define ENETC_VSI_SITDFCR_COUNT_SHIFT            (0U)
#define ENETC_VSI_SITDFCR_COUNT_WIDTH            (32U)
#define ENETC_VSI_SITDFCR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITDFCR_COUNT_SHIFT)) & ENETC_VSI_SITDFCR_COUNT_MASK)
/*! @} */

/*! @name SIBLPR - Station interface boot loader parameter register 0..Station interface boot loader parameter register 1 */
/*! @{ */

#define ENETC_VSI_SIBLPR_PARAM_VAL_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SIBLPR_PARAM_VAL_SHIFT         (0U)
#define ENETC_VSI_SIBLPR_PARAM_VAL_WIDTH         (32U)
#define ENETC_VSI_SIBLPR_PARAM_VAL(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIBLPR_PARAM_VAL_SHIFT)) & ENETC_VSI_SIBLPR_PARAM_VAL_MASK)
/*! @} */

/*! @name SICBDRMR - Station interface command BDR mode register */
/*! @{ */

#define ENETC_VSI_SICBDRMR_EN_MASK               (0x80000000U)
#define ENETC_VSI_SICBDRMR_EN_SHIFT              (31U)
#define ENETC_VSI_SICBDRMR_EN_WIDTH              (1U)
#define ENETC_VSI_SICBDRMR_EN(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRMR_EN_SHIFT)) & ENETC_VSI_SICBDRMR_EN_MASK)
/*! @} */

/*! @name SICBDRSR - Station interface command BDR status register */
/*! @{ */

#define ENETC_VSI_SICBDRSR_BUSY_MASK             (0x1U)
#define ENETC_VSI_SICBDRSR_BUSY_SHIFT            (0U)
#define ENETC_VSI_SICBDRSR_BUSY_WIDTH            (1U)
#define ENETC_VSI_SICBDRSR_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRSR_BUSY_SHIFT)) & ENETC_VSI_SICBDRSR_BUSY_MASK)
/*! @} */

/*! @name SICBDRBAR0 - Station interface command BDR base address register 0 */
/*! @{ */

#define ENETC_VSI_SICBDRBAR0_ADDRL_MASK          (0xFFFFFF80U)
#define ENETC_VSI_SICBDRBAR0_ADDRL_SHIFT         (7U)
#define ENETC_VSI_SICBDRBAR0_ADDRL_WIDTH         (25U)
#define ENETC_VSI_SICBDRBAR0_ADDRL(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRBAR0_ADDRL_SHIFT)) & ENETC_VSI_SICBDRBAR0_ADDRL_MASK)
/*! @} */

/*! @name SICBDRBAR1 - Station interface command BDR base address register 1 */
/*! @{ */

#define ENETC_VSI_SICBDRBAR1_ADDRH_MASK          (0xFFFFFFFFU)
#define ENETC_VSI_SICBDRBAR1_ADDRH_SHIFT         (0U)
#define ENETC_VSI_SICBDRBAR1_ADDRH_WIDTH         (32U)
#define ENETC_VSI_SICBDRBAR1_ADDRH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRBAR1_ADDRH_SHIFT)) & ENETC_VSI_SICBDRBAR1_ADDRH_MASK)
/*! @} */

/*! @name SICBDRPIR - Station interface command BDR producer index register */
/*! @{ */

#define ENETC_VSI_SICBDRPIR_BDR_INDEX_MASK       (0x3FFU)
#define ENETC_VSI_SICBDRPIR_BDR_INDEX_SHIFT      (0U)
#define ENETC_VSI_SICBDRPIR_BDR_INDEX_WIDTH      (10U)
#define ENETC_VSI_SICBDRPIR_BDR_INDEX(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRPIR_BDR_INDEX_SHIFT)) & ENETC_VSI_SICBDRPIR_BDR_INDEX_MASK)
/*! @} */

/*! @name SICBDRCIR - Station interface command BDR consumer index register */
/*! @{ */

