zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SICBDRCIR_BDR_INDEX_MASK       (0x3FFU)
#define ENETC_VSI_SICBDRCIR_BDR_INDEX_SHIFT      (0U)
#define ENETC_VSI_SICBDRCIR_BDR_INDEX_WIDTH      (10U)
#define ENETC_VSI_SICBDRCIR_BDR_INDEX(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRCIR_BDR_INDEX_SHIFT)) & ENETC_VSI_SICBDRCIR_BDR_INDEX_MASK)

#define ENETC_VSI_SICBDRCIR_SBE_MASK             (0x80000000U)
#define ENETC_VSI_SICBDRCIR_SBE_SHIFT            (31U)
#define ENETC_VSI_SICBDRCIR_SBE_WIDTH            (1U)
#define ENETC_VSI_SICBDRCIR_SBE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRCIR_SBE_SHIFT)) & ENETC_VSI_SICBDRCIR_SBE_MASK)
/*! @} */

/*! @name SICBDRLENR - Station interface command BDR length register */
/*! @{ */

#define ENETC_VSI_SICBDRLENR_LENGTH_MASK         (0x7F8U)
#define ENETC_VSI_SICBDRLENR_LENGTH_SHIFT        (3U)
#define ENETC_VSI_SICBDRLENR_LENGTH_WIDTH        (8U)
#define ENETC_VSI_SICBDRLENR_LENGTH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRLENR_LENGTH_SHIFT)) & ENETC_VSI_SICBDRLENR_LENGTH_MASK)
/*! @} */

/*! @name SICBDRIER - Station interface command BDR interrupt enable register */
/*! @{ */

#define ENETC_VSI_SICBDRIER_CBDCIE_MASK          (0x1U)
#define ENETC_VSI_SICBDRIER_CBDCIE_SHIFT         (0U)
#define ENETC_VSI_SICBDRIER_CBDCIE_WIDTH         (1U)
#define ENETC_VSI_SICBDRIER_CBDCIE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRIER_CBDCIE_SHIFT)) & ENETC_VSI_SICBDRIER_CBDCIE_MASK)
/*! @} */

/*! @name SICBDRIDR - Station interface command BDR interrupt detect register */
/*! @{ */

#define ENETC_VSI_SICBDRIDR_CBDC_MASK            (0x1U)
#define ENETC_VSI_SICBDRIDR_CBDC_SHIFT           (0U)
#define ENETC_VSI_SICBDRIDR_CBDC_WIDTH           (1U)
#define ENETC_VSI_SICBDRIDR_CBDC(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICBDRIDR_CBDC_SHIFT)) & ENETC_VSI_SICBDRIDR_CBDC_MASK)
/*! @} */

/*! @name SICAPR0 - Station interface capability register 0 */
/*! @{ */

#define ENETC_VSI_SICAPR0_NUM_TX_BDR_MASK        (0xFFU)
#define ENETC_VSI_SICAPR0_NUM_TX_BDR_SHIFT       (0U)
#define ENETC_VSI_SICAPR0_NUM_TX_BDR_WIDTH       (8U)
#define ENETC_VSI_SICAPR0_NUM_TX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICAPR0_NUM_TX_BDR_SHIFT)) & ENETC_VSI_SICAPR0_NUM_TX_BDR_MASK)

#define ENETC_VSI_SICAPR0_NUM_RX_BDR_MASK        (0xFF0000U)
#define ENETC_VSI_SICAPR0_NUM_RX_BDR_SHIFT       (16U)
#define ENETC_VSI_SICAPR0_NUM_RX_BDR_WIDTH       (8U)
#define ENETC_VSI_SICAPR0_NUM_RX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICAPR0_NUM_RX_BDR_SHIFT)) & ENETC_VSI_SICAPR0_NUM_RX_BDR_MASK)
/*! @} */

/*! @name SICAPR1 - Station interface capability register 1 */
/*! @{ */

#define ENETC_VSI_SICAPR1_NUM_RX_GRP_MASK        (0xFF0000U)
#define ENETC_VSI_SICAPR1_NUM_RX_GRP_SHIFT       (16U)
#define ENETC_VSI_SICAPR1_NUM_RX_GRP_WIDTH       (8U)
#define ENETC_VSI_SICAPR1_NUM_RX_GRP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICAPR1_NUM_RX_GRP_SHIFT)) & ENETC_VSI_SICAPR1_NUM_RX_GRP_MASK)
/*! @} */

/*! @name SICAPR2 - Station interface capability register 2 */
/*! @{ */

#define ENETC_VSI_SICAPR2_VTP_MASK               (0xFU)
#define ENETC_VSI_SICAPR2_VTP_SHIFT              (0U)
#define ENETC_VSI_SICAPR2_VTP_WIDTH              (4U)
#define ENETC_VSI_SICAPR2_VTP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICAPR2_VTP_SHIFT)) & ENETC_VSI_SICAPR2_VTP_MASK)
/*! @} */

/*! @name VSIIER - Virtual station interface interrupt enable register */
/*! @{ */

#define ENETC_VSI_VSIIER_MSIE_MASK               (0x100U)
#define ENETC_VSI_VSIIER_MSIE_SHIFT              (8U)
#define ENETC_VSI_VSIIER_MSIE_WIDTH              (1U)
#define ENETC_VSI_VSIIER_MSIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_VSIIER_MSIE_SHIFT)) & ENETC_VSI_VSIIER_MSIE_MASK)

#define ENETC_VSI_VSIIER_MRIE_MASK               (0x200U)
#define ENETC_VSI_VSIIER_MRIE_SHIFT              (9U)
#define ENETC_VSI_VSIIER_MRIE_WIDTH              (1U)
#define ENETC_VSI_VSIIER_MRIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_VSIIER_MRIE_SHIFT)) & ENETC_VSI_VSIIER_MRIE_MASK)
/*! @} */

/*! @name VSIIDR - Virtual station interface interrupt detect register */
/*! @{ */

#define ENETC_VSI_VSIIDR_TXR_MASK                (0x1U)
#define ENETC_VSI_VSIIDR_TXR_SHIFT               (0U)
#define ENETC_VSI_VSIIDR_TXR_WIDTH               (1U)
#define ENETC_VSI_VSIIDR_TXR(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_VSIIDR_TXR_SHIFT)) & ENETC_VSI_VSIIDR_TXR_MASK)

#define ENETC_VSI_VSIIDR_MS_MASK                 (0x100U)
#define ENETC_VSI_VSIIDR_MS_SHIFT                (8U)
#define ENETC_VSI_VSIIDR_MS_WIDTH                (1U)
#define ENETC_VSI_VSIIDR_MS(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_VSIIDR_MS_SHIFT)) & ENETC_VSI_VSIIDR_MS_MASK)

#define ENETC_VSI_VSIIDR_MR_MASK                 (0x200U)
#define ENETC_VSI_VSIIDR_MR_SHIFT                (9U)
#define ENETC_VSI_VSIIDR_MR_WIDTH                (1U)
#define ENETC_VSI_VSIIDR_MR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_VSIIDR_MR_SHIFT)) & ENETC_VSI_VSIIDR_MR_MASK)

#define ENETC_VSI_VSIIDR_RXR_MASK                (0x10000U)
#define ENETC_VSI_VSIIDR_RXR_SHIFT               (16U)
#define ENETC_VSI_VSIIDR_RXR_WIDTH               (1U)
#define ENETC_VSI_VSIIDR_RXR(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_VSIIDR_RXR_SHIFT)) & ENETC_VSI_VSIIDR_RXR_MASK)
/*! @} */

/*! @name SITXIDR0 - Station interface transmit interrupt detect register 0 */
/*! @{ */

#define ENETC_VSI_SITXIDR0_TXT0_MASK             (0x1U)
#define ENETC_VSI_SITXIDR0_TXT0_SHIFT            (0U)
#define ENETC_VSI_SITXIDR0_TXT0_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT0(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT0_SHIFT)) & ENETC_VSI_SITXIDR0_TXT0_MASK)

#define ENETC_VSI_SITXIDR0_TXT1_MASK             (0x2U)
#define ENETC_VSI_SITXIDR0_TXT1_SHIFT            (1U)
#define ENETC_VSI_SITXIDR0_TXT1_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT1(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT1_SHIFT)) & ENETC_VSI_SITXIDR0_TXT1_MASK)

#define ENETC_VSI_SITXIDR0_TXT2_MASK             (0x4U)
#define ENETC_VSI_SITXIDR0_TXT2_SHIFT            (2U)
#define ENETC_VSI_SITXIDR0_TXT2_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT2(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT2_SHIFT)) & ENETC_VSI_SITXIDR0_TXT2_MASK)

#define ENETC_VSI_SITXIDR0_TXT3_MASK             (0x8U)
#define ENETC_VSI_SITXIDR0_TXT3_SHIFT            (3U)
#define ENETC_VSI_SITXIDR0_TXT3_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT3(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT3_SHIFT)) & ENETC_VSI_SITXIDR0_TXT3_MASK)

#define ENETC_VSI_SITXIDR0_TXT4_MASK             (0x10U)
#define ENETC_VSI_SITXIDR0_TXT4_SHIFT            (4U)
#define ENETC_VSI_SITXIDR0_TXT4_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT4(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT4_SHIFT)) & ENETC_VSI_SITXIDR0_TXT4_MASK)

#define ENETC_VSI_SITXIDR0_TXT5_MASK             (0x20U)
#define ENETC_VSI_SITXIDR0_TXT5_SHIFT            (5U)
#define ENETC_VSI_SITXIDR0_TXT5_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT5(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT5_SHIFT)) & ENETC_VSI_SITXIDR0_TXT5_MASK)

#define ENETC_VSI_SITXIDR0_TXT6_MASK             (0x40U)
#define ENETC_VSI_SITXIDR0_TXT6_SHIFT            (6U)
#define ENETC_VSI_SITXIDR0_TXT6_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT6(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT6_SHIFT)) & ENETC_VSI_SITXIDR0_TXT6_MASK)

#define ENETC_VSI_SITXIDR0_TXT7_MASK             (0x80U)
#define ENETC_VSI_SITXIDR0_TXT7_SHIFT            (7U)
#define ENETC_VSI_SITXIDR0_TXT7_WIDTH            (1U)
#define ENETC_VSI_SITXIDR0_TXT7(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITXIDR0_TXT7_SHIFT)) & ENETC_VSI_SITXIDR0_TXT7_MASK)

