zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SIRXIDR0_RX7_MASK              (0x80U)
#define ENETC_VSI_SIRXIDR0_RX7_SHIFT             (7U)
#define ENETC_VSI_SIRXIDR0_RX7_WIDTH             (1U)
#define ENETC_VSI_SIRXIDR0_RX7(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX7_SHIFT)) & ENETC_VSI_SIRXIDR0_RX7_MASK)

#define ENETC_VSI_SIRXIDR0_RX8_MASK              (0x100U)
#define ENETC_VSI_SIRXIDR0_RX8_SHIFT             (8U)
#define ENETC_VSI_SIRXIDR0_RX8_WIDTH             (1U)
#define ENETC_VSI_SIRXIDR0_RX8(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX8_SHIFT)) & ENETC_VSI_SIRXIDR0_RX8_MASK)

#define ENETC_VSI_SIRXIDR0_RX9_MASK              (0x200U)
#define ENETC_VSI_SIRXIDR0_RX9_SHIFT             (9U)
#define ENETC_VSI_SIRXIDR0_RX9_WIDTH             (1U)
#define ENETC_VSI_SIRXIDR0_RX9(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX9_SHIFT)) & ENETC_VSI_SIRXIDR0_RX9_MASK)

#define ENETC_VSI_SIRXIDR0_RX10_MASK             (0x400U)
#define ENETC_VSI_SIRXIDR0_RX10_SHIFT            (10U)
#define ENETC_VSI_SIRXIDR0_RX10_WIDTH            (1U)
#define ENETC_VSI_SIRXIDR0_RX10(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX10_SHIFT)) & ENETC_VSI_SIRXIDR0_RX10_MASK)

#define ENETC_VSI_SIRXIDR0_RX11_MASK             (0x800U)
#define ENETC_VSI_SIRXIDR0_RX11_SHIFT            (11U)
#define ENETC_VSI_SIRXIDR0_RX11_WIDTH            (1U)
#define ENETC_VSI_SIRXIDR0_RX11(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX11_SHIFT)) & ENETC_VSI_SIRXIDR0_RX11_MASK)

#define ENETC_VSI_SIRXIDR0_RX12_MASK             (0x1000U)
#define ENETC_VSI_SIRXIDR0_RX12_SHIFT            (12U)
#define ENETC_VSI_SIRXIDR0_RX12_WIDTH            (1U)
#define ENETC_VSI_SIRXIDR0_RX12(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX12_SHIFT)) & ENETC_VSI_SIRXIDR0_RX12_MASK)

#define ENETC_VSI_SIRXIDR0_RX13_MASK             (0x2000U)
#define ENETC_VSI_SIRXIDR0_RX13_SHIFT            (13U)
#define ENETC_VSI_SIRXIDR0_RX13_WIDTH            (1U)
#define ENETC_VSI_SIRXIDR0_RX13(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRXIDR0_RX13_SHIFT)) & ENETC_VSI_SIRXIDR0_RX13_MASK)
/*! @} */

/*! @name SIMSIVR - Station interface MSI-X vector register */
/*! @{ */

#define ENETC_VSI_SIMSIVR_VECTOR_MASK            (0x3FU)
#define ENETC_VSI_SIMSIVR_VECTOR_SHIFT           (0U)
#define ENETC_VSI_SIMSIVR_VECTOR_WIDTH           (6U)
#define ENETC_VSI_SIMSIVR_VECTOR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMSIVR_VECTOR_SHIFT)) & ENETC_VSI_SIMSIVR_VECTOR_MASK)
/*! @} */

/*! @name SICMSIVR - Station interface command MSI-X vector register */
/*! @{ */

#define ENETC_VSI_SICMSIVR_VECTOR_MASK           (0x3FU)
#define ENETC_VSI_SICMSIVR_VECTOR_SHIFT          (0U)
#define ENETC_VSI_SICMSIVR_VECTOR_WIDTH          (6U)
#define ENETC_VSI_SICMSIVR_VECTOR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICMSIVR_VECTOR_SHIFT)) & ENETC_VSI_SICMSIVR_VECTOR_MASK)
/*! @} */

/*! @name SITMRIER - Station interface timer interrupt enable register */
/*! @{ */

#define ENETC_VSI_SITMRIER_SYNCE_MASK            (0x1U)
#define ENETC_VSI_SITMRIER_SYNCE_SHIFT           (0U)
#define ENETC_VSI_SITMRIER_SYNCE_WIDTH           (1U)
#define ENETC_VSI_SITMRIER_SYNCE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITMRIER_SYNCE_SHIFT)) & ENETC_VSI_SITMRIER_SYNCE_MASK)
/*! @} */

/*! @name SITMRIDR - Station interface timer interrupt detect register */
/*! @{ */

#define ENETC_VSI_SITMRIDR_SYNC_MASK             (0x1U)
#define ENETC_VSI_SITMRIDR_SYNC_SHIFT            (0U)
#define ENETC_VSI_SITMRIDR_SYNC_WIDTH            (1U)
#define ENETC_VSI_SITMRIDR_SYNC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITMRIDR_SYNC_SHIFT)) & ENETC_VSI_SITMRIDR_SYNC_MASK)
/*! @} */

/*! @name SITMRMSIVR - Station interface timer MSI-X vector register */
/*! @{ */

#define ENETC_VSI_SITMRMSIVR_VECTOR_MASK         (0x3FU)
#define ENETC_VSI_SITMRMSIVR_VECTOR_SHIFT        (0U)
#define ENETC_VSI_SITMRMSIVR_VECTOR_WIDTH        (6U)
#define ENETC_VSI_SITMRMSIVR_VECTOR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SITMRMSIVR_VECTOR_SHIFT)) & ENETC_VSI_SITMRMSIVR_VECTOR_MASK)
/*! @} */

/*! @name SIMSITRVR - Station interface MSI-X transmit ring 0 vector register..Station interface MSI-X transmit ring 13 vector register */
/*! @{ */

#define ENETC_VSI_SIMSITRVR_VECTOR_MASK          (0x3FU)
#define ENETC_VSI_SIMSITRVR_VECTOR_SHIFT         (0U)
#define ENETC_VSI_SIMSITRVR_VECTOR_WIDTH         (6U)
#define ENETC_VSI_SIMSITRVR_VECTOR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMSITRVR_VECTOR_SHIFT)) & ENETC_VSI_SIMSITRVR_VECTOR_MASK)
/*! @} */

/*! @name SIMSIRRVR - Station interface MSI-X receive ring 0 vector register..Station interface MSI-X receive ring 13 vector register */
/*! @{ */

#define ENETC_VSI_SIMSIRRVR_VECTOR_MASK          (0x3FU)
#define ENETC_VSI_SIMSIRRVR_VECTOR_SHIFT         (0U)
#define ENETC_VSI_SIMSIRRVR_VECTOR_WIDTH         (6U)
#define ENETC_VSI_SIMSIRRVR_VECTOR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMSIRRVR_VECTOR_SHIFT)) & ENETC_VSI_SIMSIRRVR_VECTOR_MASK)
/*! @} */

/*! @name SICMECR - Station interface correctable memory error configuration register */
/*! @{ */

#define ENETC_VSI_SICMECR_THRESHOLD_MASK         (0xFFU)
#define ENETC_VSI_SICMECR_THRESHOLD_SHIFT        (0U)
#define ENETC_VSI_SICMECR_THRESHOLD_WIDTH        (8U)
#define ENETC_VSI_SICMECR_THRESHOLD(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICMECR_THRESHOLD_SHIFT)) & ENETC_VSI_SICMECR_THRESHOLD_MASK)
/*! @} */

/*! @name SICMESR - Station interface correctable memory error status register */
/*! @{ */

#define ENETC_VSI_SICMESR_LINK_SLICE_ID_MASK     (0x1FU)
#define ENETC_VSI_SICMESR_LINK_SLICE_ID_SHIFT    (0U)
#define ENETC_VSI_SICMESR_LINK_SLICE_ID_WIDTH    (5U)
#define ENETC_VSI_SICMESR_LINK_SLICE_ID(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICMESR_LINK_SLICE_ID_SHIFT)) & ENETC_VSI_SICMESR_LINK_SLICE_ID_MASK)

