zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SICMESR_MEM_ID_MASK            (0x1F00U)
#define ENETC_VSI_SICMESR_MEM_ID_SHIFT           (8U)
#define ENETC_VSI_SICMESR_MEM_ID_WIDTH           (5U)
#define ENETC_VSI_SICMESR_MEM_ID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICMESR_MEM_ID_SHIFT)) & ENETC_VSI_SICMESR_MEM_ID_MASK)

#define ENETC_VSI_SICMESR_SBEE_MASK              (0x80000000U)
#define ENETC_VSI_SICMESR_SBEE_SHIFT             (31U)
#define ENETC_VSI_SICMESR_SBEE_WIDTH             (1U)
#define ENETC_VSI_SICMESR_SBEE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICMESR_SBEE_SHIFT)) & ENETC_VSI_SICMESR_SBEE_MASK)
/*! @} */

/*! @name SICMECTR - Station interface correctable memory error count register */
/*! @{ */

#define ENETC_VSI_SICMECTR_COUNT_MASK            (0xFFU)
#define ENETC_VSI_SICMECTR_COUNT_SHIFT           (0U)
#define ENETC_VSI_SICMECTR_COUNT_WIDTH           (8U)
#define ENETC_VSI_SICMECTR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SICMECTR_COUNT_SHIFT)) & ENETC_VSI_SICMECTR_COUNT_MASK)
/*! @} */

/*! @name SIUPECR - Station interface uncorrectable programming error configuration register */
/*! @{ */

#define ENETC_VSI_SIUPECR_RD_MASK                (0x80000000U)
#define ENETC_VSI_SIUPECR_RD_SHIFT               (31U)
#define ENETC_VSI_SIUPECR_RD_WIDTH               (1U)
#define ENETC_VSI_SIUPECR_RD(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPECR_RD_SHIFT)) & ENETC_VSI_SIUPECR_RD_MASK)
/*! @} */

/*! @name SIUPESR - Station interface uncorrectable programming error status register */
/*! @{ */

#define ENETC_VSI_SIUPESR_DROP_SI_EN_MASK        (0x1U)
#define ENETC_VSI_SIUPESR_DROP_SI_EN_SHIFT       (0U)
#define ENETC_VSI_SIUPESR_DROP_SI_EN_WIDTH       (1U)
#define ENETC_VSI_SIUPESR_DROP_SI_EN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPESR_DROP_SI_EN_SHIFT)) & ENETC_VSI_SIUPESR_DROP_SI_EN_MASK)

#define ENETC_VSI_SIUPESR_DROP_RING_EN_MASK      (0x2U)
#define ENETC_VSI_SIUPESR_DROP_RING_EN_SHIFT     (1U)
#define ENETC_VSI_SIUPESR_DROP_RING_EN_WIDTH     (1U)
#define ENETC_VSI_SIUPESR_DROP_RING_EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPESR_DROP_RING_EN_SHIFT)) & ENETC_VSI_SIUPESR_DROP_RING_EN_MASK)

#define ENETC_VSI_SIUPESR_DROP_GRP_SEL_MASK      (0x4U)
#define ENETC_VSI_SIUPESR_DROP_GRP_SEL_SHIFT     (2U)
#define ENETC_VSI_SIUPESR_DROP_GRP_SEL_WIDTH     (1U)
#define ENETC_VSI_SIUPESR_DROP_GRP_SEL(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPESR_DROP_GRP_SEL_SHIFT)) & ENETC_VSI_SIUPESR_DROP_GRP_SEL_MASK)

#define ENETC_VSI_SIUPESR_DROP_RING_SEL_MASK     (0x8U)
#define ENETC_VSI_SIUPESR_DROP_RING_SEL_SHIFT    (3U)
#define ENETC_VSI_SIUPESR_DROP_RING_SEL_WIDTH    (1U)
#define ENETC_VSI_SIUPESR_DROP_RING_SEL(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPESR_DROP_RING_SEL_SHIFT)) & ENETC_VSI_SIUPESR_DROP_RING_SEL_MASK)

#define ENETC_VSI_SIUPESR_M_MASK                 (0x40000000U)
#define ENETC_VSI_SIUPESR_M_SHIFT                (30U)
#define ENETC_VSI_SIUPESR_M_WIDTH                (1U)
#define ENETC_VSI_SIUPESR_M(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPESR_M_SHIFT)) & ENETC_VSI_SIUPESR_M_MASK)

#define ENETC_VSI_SIUPESR_PE_MASK                (0x80000000U)
#define ENETC_VSI_SIUPESR_PE_SHIFT               (31U)
#define ENETC_VSI_SIUPESR_PE_WIDTH               (1U)
#define ENETC_VSI_SIUPESR_PE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPESR_PE_SHIFT)) & ENETC_VSI_SIUPESR_PE_MASK)
/*! @} */

/*! @name SIUPECTR - Station interface uncorrectable programming error count register */
/*! @{ */

#define ENETC_VSI_SIUPECTR_COUNT_MASK            (0xFFFFFFFFU)
#define ENETC_VSI_SIUPECTR_COUNT_SHIFT           (0U)
#define ENETC_VSI_SIUPECTR_COUNT_WIDTH           (32U)
#define ENETC_VSI_SIUPECTR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUPECTR_COUNT_SHIFT)) & ENETC_VSI_SIUPECTR_COUNT_MASK)
/*! @} */

/*! @name SIUNSBECR - Station interface uncorrectable non-fatal system bus error configuration register */
/*! @{ */

#define ENETC_VSI_SIUNSBECR_THRESHOLD_MASK       (0xFFU)
#define ENETC_VSI_SIUNSBECR_THRESHOLD_SHIFT      (0U)
#define ENETC_VSI_SIUNSBECR_THRESHOLD_WIDTH      (8U)
#define ENETC_VSI_SIUNSBECR_THRESHOLD(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNSBECR_THRESHOLD_SHIFT)) & ENETC_VSI_SIUNSBECR_THRESHOLD_MASK)
/*! @} */

/*! @name SIUNSBESR - Station interface uncorrectable non-fatal system bus error status register */
/*! @{ */

#define ENETC_VSI_SIUNSBESR_SB_ID_MASK           (0xF00U)
#define ENETC_VSI_SIUNSBESR_SB_ID_SHIFT          (8U)
#define ENETC_VSI_SIUNSBESR_SB_ID_WIDTH          (4U)
#define ENETC_VSI_SIUNSBESR_SB_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNSBESR_SB_ID_SHIFT)) & ENETC_VSI_SIUNSBESR_SB_ID_MASK)

#define ENETC_VSI_SIUNSBESR_SBE_MASK             (0x80000000U)
#define ENETC_VSI_SIUNSBESR_SBE_SHIFT            (31U)
#define ENETC_VSI_SIUNSBESR_SBE_WIDTH            (1U)
#define ENETC_VSI_SIUNSBESR_SBE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNSBESR_SBE_SHIFT)) & ENETC_VSI_SIUNSBESR_SBE_MASK)
/*! @} */

/*! @name SIUNSBECTR - Station interface uncorrectable non-fatal system bus error count register */
/*! @{ */

#define ENETC_VSI_SIUNSBECTR_COUNT_MASK          (0xFFU)
#define ENETC_VSI_SIUNSBECTR_COUNT_SHIFT         (0U)
#define ENETC_VSI_SIUNSBECTR_COUNT_WIDTH         (8U)
#define ENETC_VSI_SIUNSBECTR_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNSBECTR_COUNT_SHIFT)) & ENETC_VSI_SIUNSBECTR_COUNT_MASK)
/*! @} */

/*! @name SIUFSBECR - Station interface uncorrectable fatal system bus error configuration register */
/*! @{ */

#define ENETC_VSI_SIUFSBECR_RD_MASK              (0x80000000U)
#define ENETC_VSI_SIUFSBECR_RD_SHIFT             (31U)
#define ENETC_VSI_SIUFSBECR_RD_WIDTH             (1U)
#define ENETC_VSI_SIUFSBECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFSBECR_RD_SHIFT)) & ENETC_VSI_SIUFSBECR_RD_MASK)
/*! @} */

/*! @name SIUFSBESR - Station interface uncorrectable fatal system bus error status register */
/*! @{ */

#define ENETC_VSI_SIUFSBESR_SB_ID_MASK           (0xF00U)
#define ENETC_VSI_SIUFSBESR_SB_ID_SHIFT          (8U)
#define ENETC_VSI_SIUFSBESR_SB_ID_WIDTH          (4U)
#define ENETC_VSI_SIUFSBESR_SB_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFSBESR_SB_ID_SHIFT)) & ENETC_VSI_SIUFSBESR_SB_ID_MASK)

#define ENETC_VSI_SIUFSBESR_M_MASK               (0x40000000U)
#define ENETC_VSI_SIUFSBESR_M_SHIFT              (30U)
#define ENETC_VSI_SIUFSBESR_M_WIDTH              (1U)
#define ENETC_VSI_SIUFSBESR_M(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFSBESR_M_SHIFT)) & ENETC_VSI_SIUFSBESR_M_MASK)

#define ENETC_VSI_SIUFSBESR_SBE_MASK             (0x80000000U)
#define ENETC_VSI_SIUFSBESR_SBE_SHIFT            (31U)
#define ENETC_VSI_SIUFSBESR_SBE_WIDTH            (1U)
#define ENETC_VSI_SIUFSBESR_SBE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFSBESR_SBE_SHIFT)) & ENETC_VSI_SIUFSBESR_SBE_MASK)
/*! @} */

