zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
/*! @name SIUNMECR - Station interface uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define ENETC_VSI_SIUNMECR_THRESHOLD_MASK        (0xFFU)
#define ENETC_VSI_SIUNMECR_THRESHOLD_SHIFT       (0U)
#define ENETC_VSI_SIUNMECR_THRESHOLD_WIDTH       (8U)
#define ENETC_VSI_SIUNMECR_THRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMECR_THRESHOLD_SHIFT)) & ENETC_VSI_SIUNMECR_THRESHOLD_MASK)

#define ENETC_VSI_SIUNMECR_RD_MASK               (0x80000000U)
#define ENETC_VSI_SIUNMECR_RD_SHIFT              (31U)
#define ENETC_VSI_SIUNMECR_RD_WIDTH              (1U)
#define ENETC_VSI_SIUNMECR_RD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMECR_RD_SHIFT)) & ENETC_VSI_SIUNMECR_RD_MASK)
/*! @} */

/*! @name SIUNMESR0 - Station interface uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define ENETC_VSI_SIUNMESR0_MEM_ID_MASK          (0x1F00U)
#define ENETC_VSI_SIUNMESR0_MEM_ID_SHIFT         (8U)
#define ENETC_VSI_SIUNMESR0_MEM_ID_WIDTH         (5U)
#define ENETC_VSI_SIUNMESR0_MEM_ID(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMESR0_MEM_ID_SHIFT)) & ENETC_VSI_SIUNMESR0_MEM_ID_MASK)

#define ENETC_VSI_SIUNMESR0_SYNDROME_MASK        (0x7FF0000U)
#define ENETC_VSI_SIUNMESR0_SYNDROME_SHIFT       (16U)
#define ENETC_VSI_SIUNMESR0_SYNDROME_WIDTH       (11U)
#define ENETC_VSI_SIUNMESR0_SYNDROME(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMESR0_SYNDROME_SHIFT)) & ENETC_VSI_SIUNMESR0_SYNDROME_MASK)

#define ENETC_VSI_SIUNMESR0_MBEE_MASK            (0x80000000U)
#define ENETC_VSI_SIUNMESR0_MBEE_SHIFT           (31U)
#define ENETC_VSI_SIUNMESR0_MBEE_WIDTH           (1U)
#define ENETC_VSI_SIUNMESR0_MBEE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMESR0_MBEE_SHIFT)) & ENETC_VSI_SIUNMESR0_MBEE_MASK)
/*! @} */

/*! @name SIUNMESR1 - Station interface uncorrectable non-fatal memory error status register 1 */
/*! @{ */

#define ENETC_VSI_SIUNMESR1_ADDR_MASK            (0xFFFFFFFFU)
#define ENETC_VSI_SIUNMESR1_ADDR_SHIFT           (0U)
#define ENETC_VSI_SIUNMESR1_ADDR_WIDTH           (32U)
#define ENETC_VSI_SIUNMESR1_ADDR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMESR1_ADDR_SHIFT)) & ENETC_VSI_SIUNMESR1_ADDR_MASK)
/*! @} */

/*! @name SIUNMECTR - Station interface uncorrectable non-fatal memory error count register */
/*! @{ */

#define ENETC_VSI_SIUNMECTR_COUNT_MASK           (0xFFU)
#define ENETC_VSI_SIUNMECTR_COUNT_SHIFT          (0U)
#define ENETC_VSI_SIUNMECTR_COUNT_WIDTH          (8U)
#define ENETC_VSI_SIUNMECTR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNMECTR_COUNT_SHIFT)) & ENETC_VSI_SIUNMECTR_COUNT_MASK)
/*! @} */

/*! @name SIUFMECR - Station interface uncorrectable fatal memory error configuration register */
/*! @{ */

#define ENETC_VSI_SIUFMECR_RD_MASK               (0x80000000U)
#define ENETC_VSI_SIUFMECR_RD_SHIFT              (31U)
#define ENETC_VSI_SIUFMECR_RD_WIDTH              (1U)
#define ENETC_VSI_SIUFMECR_RD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMECR_RD_SHIFT)) & ENETC_VSI_SIUFMECR_RD_MASK)
/*! @} */

/*! @name SIUFMESR0 - Station interface uncorrectable fatal memory error status register 0 */
/*! @{ */

#define ENETC_VSI_SIUFMESR0_LINK_SLICE_ID_MASK   (0x1FU)
#define ENETC_VSI_SIUFMESR0_LINK_SLICE_ID_SHIFT  (0U)
#define ENETC_VSI_SIUFMESR0_LINK_SLICE_ID_WIDTH  (5U)
#define ENETC_VSI_SIUFMESR0_LINK_SLICE_ID(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR0_LINK_SLICE_ID_SHIFT)) & ENETC_VSI_SIUFMESR0_LINK_SLICE_ID_MASK)

#define ENETC_VSI_SIUFMESR0_MEM_ID_MASK          (0x1F00U)
#define ENETC_VSI_SIUFMESR0_MEM_ID_SHIFT         (8U)
#define ENETC_VSI_SIUFMESR0_MEM_ID_WIDTH         (5U)
#define ENETC_VSI_SIUFMESR0_MEM_ID(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR0_MEM_ID_SHIFT)) & ENETC_VSI_SIUFMESR0_MEM_ID_MASK)

#define ENETC_VSI_SIUFMESR0_EDCE_MASK            (0x8000U)
#define ENETC_VSI_SIUFMESR0_EDCE_SHIFT           (15U)
#define ENETC_VSI_SIUFMESR0_EDCE_WIDTH           (1U)
#define ENETC_VSI_SIUFMESR0_EDCE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR0_EDCE_SHIFT)) & ENETC_VSI_SIUFMESR0_EDCE_MASK)

#define ENETC_VSI_SIUFMESR0_SYNDROME_MASK        (0x7FF0000U)
#define ENETC_VSI_SIUFMESR0_SYNDROME_SHIFT       (16U)
#define ENETC_VSI_SIUFMESR0_SYNDROME_WIDTH       (11U)
#define ENETC_VSI_SIUFMESR0_SYNDROME(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR0_SYNDROME_SHIFT)) & ENETC_VSI_SIUFMESR0_SYNDROME_MASK)

#define ENETC_VSI_SIUFMESR0_M_MASK               (0x40000000U)
#define ENETC_VSI_SIUFMESR0_M_SHIFT              (30U)
#define ENETC_VSI_SIUFMESR0_M_WIDTH              (1U)
#define ENETC_VSI_SIUFMESR0_M(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR0_M_SHIFT)) & ENETC_VSI_SIUFMESR0_M_MASK)

#define ENETC_VSI_SIUFMESR0_MBEE_MASK            (0x80000000U)
#define ENETC_VSI_SIUFMESR0_MBEE_SHIFT           (31U)
#define ENETC_VSI_SIUFMESR0_MBEE_WIDTH           (1U)
#define ENETC_VSI_SIUFMESR0_MBEE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR0_MBEE_SHIFT)) & ENETC_VSI_SIUFMESR0_MBEE_MASK)
/*! @} */

/*! @name SIUFMESR1 - Station interface uncorrectable fatal memory error status register 1 */
/*! @{ */

#define ENETC_VSI_SIUFMESR1_ADDR_MASK            (0xFFFFFFFFU)
#define ENETC_VSI_SIUFMESR1_ADDR_SHIFT           (0U)
#define ENETC_VSI_SIUFMESR1_ADDR_WIDTH           (32U)
#define ENETC_VSI_SIUFMESR1_ADDR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFMESR1_ADDR_SHIFT)) & ENETC_VSI_SIUFMESR1_ADDR_MASK)
/*! @} */

/*! @name SIUNIECR - Station interface uncorrectable non-fatal integrity error configuration register */
/*! @{ */

#define ENETC_VSI_SIUNIECR_THRESHOLD_MASK        (0xFFU)
#define ENETC_VSI_SIUNIECR_THRESHOLD_SHIFT       (0U)
#define ENETC_VSI_SIUNIECR_THRESHOLD_WIDTH       (8U)
#define ENETC_VSI_SIUNIECR_THRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNIECR_THRESHOLD_SHIFT)) & ENETC_VSI_SIUNIECR_THRESHOLD_MASK)

#define ENETC_VSI_SIUNIECR_RD_MASK               (0x80000000U)
#define ENETC_VSI_SIUNIECR_RD_SHIFT              (31U)
#define ENETC_VSI_SIUNIECR_RD_WIDTH              (1U)
#define ENETC_VSI_SIUNIECR_RD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNIECR_RD_SHIFT)) & ENETC_VSI_SIUNIECR_RD_MASK)
/*! @} */

/*! @name SIUNIESR - Station interface uncorrectable non-fatal integrity error status register */
/*! @{ */

#define ENETC_VSI_SIUNIESR_BLOCK_ID_MASK         (0x1F00U)
#define ENETC_VSI_SIUNIESR_BLOCK_ID_SHIFT        (8U)
#define ENETC_VSI_SIUNIESR_BLOCK_ID_WIDTH        (5U)
#define ENETC_VSI_SIUNIESR_BLOCK_ID(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNIESR_BLOCK_ID_SHIFT)) & ENETC_VSI_SIUNIESR_BLOCK_ID_MASK)

#define ENETC_VSI_SIUNIESR_SM_ID_MASK            (0x3F0000U)
#define ENETC_VSI_SIUNIESR_SM_ID_SHIFT           (16U)
#define ENETC_VSI_SIUNIESR_SM_ID_WIDTH           (6U)
#define ENETC_VSI_SIUNIESR_SM_ID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNIESR_SM_ID_SHIFT)) & ENETC_VSI_SIUNIESR_SM_ID_MASK)

#define ENETC_VSI_SIUNIESR_INTERR_MASK           (0x80000000U)
#define ENETC_VSI_SIUNIESR_INTERR_SHIFT          (31U)
#define ENETC_VSI_SIUNIESR_INTERR_WIDTH          (1U)
#define ENETC_VSI_SIUNIESR_INTERR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNIESR_INTERR_SHIFT)) & ENETC_VSI_SIUNIESR_INTERR_MASK)
/*! @} */

/*! @name SIUNIECTR - Station interface uncorrectable non-fatal integrity error count register */
/*! @{ */

#define ENETC_VSI_SIUNIECTR_COUNT_MASK           (0xFFU)
#define ENETC_VSI_SIUNIECTR_COUNT_SHIFT          (0U)
#define ENETC_VSI_SIUNIECTR_COUNT_WIDTH          (8U)
#define ENETC_VSI_SIUNIECTR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUNIECTR_COUNT_SHIFT)) & ENETC_VSI_SIUNIECTR_COUNT_MASK)
/*! @} */

/*! @name SIUFIECR - Station interface uncorrectable fatal integrity error configuration register */
/*! @{ */

#define ENETC_VSI_SIUFIECR_RD_MASK               (0x80000000U)
#define ENETC_VSI_SIUFIECR_RD_SHIFT              (31U)
#define ENETC_VSI_SIUFIECR_RD_WIDTH              (1U)
#define ENETC_VSI_SIUFIECR_RD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFIECR_RD_SHIFT)) & ENETC_VSI_SIUFIECR_RD_MASK)
/*! @} */

/*! @name SIUFIESR - Station interface uncorrectable fatal integrity error status register */
/*! @{ */

#define ENETC_VSI_SIUFIESR_BLOCK_ID_MASK         (0x1F00U)
#define ENETC_VSI_SIUFIESR_BLOCK_ID_SHIFT        (8U)
#define ENETC_VSI_SIUFIESR_BLOCK_ID_WIDTH        (5U)
#define ENETC_VSI_SIUFIESR_BLOCK_ID(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFIESR_BLOCK_ID_SHIFT)) & ENETC_VSI_SIUFIESR_BLOCK_ID_MASK)

#define ENETC_VSI_SIUFIESR_SM_ID_MASK            (0x3F0000U)
#define ENETC_VSI_SIUFIESR_SM_ID_SHIFT           (16U)
#define ENETC_VSI_SIUFIESR_SM_ID_WIDTH           (6U)
#define ENETC_VSI_SIUFIESR_SM_ID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFIESR_SM_ID_SHIFT)) & ENETC_VSI_SIUFIESR_SM_ID_MASK)

#define ENETC_VSI_SIUFIESR_M_MASK                (0x40000000U)
#define ENETC_VSI_SIUFIESR_M_SHIFT               (30U)
#define ENETC_VSI_SIUFIESR_M_WIDTH               (1U)
#define ENETC_VSI_SIUFIESR_M(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFIESR_M_SHIFT)) & ENETC_VSI_SIUFIESR_M_MASK)

#define ENETC_VSI_SIUFIESR_INTERR_MASK           (0x80000000U)
#define ENETC_VSI_SIUFIESR_INTERR_SHIFT          (31U)
#define ENETC_VSI_SIUFIESR_INTERR_WIDTH          (1U)
#define ENETC_VSI_SIUFIESR_INTERR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIUFIESR_INTERR_SHIFT)) & ENETC_VSI_SIUFIESR_INTERR_MASK)
/*! @} */

/*! @name SIMAFTCAPR - Station interface MAC address filter table capability register */
/*! @{ */

