zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_SIMAFTCAPR_NUM_MAC_AFTE_MASK   (0xFFU)
#define ENETC_VSI_SIMAFTCAPR_NUM_MAC_AFTE_SHIFT  (0U)
#define ENETC_VSI_SIMAFTCAPR_NUM_MAC_AFTE_WIDTH  (8U)
#define ENETC_VSI_SIMAFTCAPR_NUM_MAC_AFTE(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMAFTCAPR_NUM_MAC_AFTE_SHIFT)) & ENETC_VSI_SIMAFTCAPR_NUM_MAC_AFTE_MASK)

#define ENETC_VSI_SIMAFTCAPR_VERSIONS_MASK       (0xFFFF0000U)
#define ENETC_VSI_SIMAFTCAPR_VERSIONS_SHIFT      (16U)
#define ENETC_VSI_SIMAFTCAPR_VERSIONS_WIDTH      (16U)
#define ENETC_VSI_SIMAFTCAPR_VERSIONS(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIMAFTCAPR_VERSIONS_SHIFT)) & ENETC_VSI_SIMAFTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SIVFTCAPR - Station interface VLAN filter table capability register */
/*! @{ */

#define ENETC_VSI_SIVFTCAPR_NUM_VLAN_FTE_MASK    (0xFFU)
#define ENETC_VSI_SIVFTCAPR_NUM_VLAN_FTE_SHIFT   (0U)
#define ENETC_VSI_SIVFTCAPR_NUM_VLAN_FTE_WIDTH   (8U)
#define ENETC_VSI_SIVFTCAPR_NUM_VLAN_FTE(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVFTCAPR_NUM_VLAN_FTE_SHIFT)) & ENETC_VSI_SIVFTCAPR_NUM_VLAN_FTE_MASK)

#define ENETC_VSI_SIVFTCAPR_VERSIONS_MASK        (0xFFFF0000U)
#define ENETC_VSI_SIVFTCAPR_VERSIONS_SHIFT       (16U)
#define ENETC_VSI_SIVFTCAPR_VERSIONS_WIDTH       (16U)
#define ENETC_VSI_SIVFTCAPR_VERSIONS(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIVFTCAPR_VERSIONS_SHIFT)) & ENETC_VSI_SIVFTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SIRFSCAPR - Station interface RFS capability register */
/*! @{ */

#define ENETC_VSI_SIRFSCAPR_NUM_RFS_MASK         (0x1FFU)
#define ENETC_VSI_SIRFSCAPR_NUM_RFS_SHIFT        (0U)
#define ENETC_VSI_SIRFSCAPR_NUM_RFS_WIDTH        (9U)
#define ENETC_VSI_SIRFSCAPR_NUM_RFS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRFSCAPR_NUM_RFS_SHIFT)) & ENETC_VSI_SIRFSCAPR_NUM_RFS_MASK)

#define ENETC_VSI_SIRFSCAPR_VERSIONS_MASK        (0xFFFF0000U)
#define ENETC_VSI_SIRFSCAPR_VERSIONS_SHIFT       (16U)
#define ENETC_VSI_SIRFSCAPR_VERSIONS_WIDTH       (16U)
#define ENETC_VSI_SIRFSCAPR_VERSIONS(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_SIRFSCAPR_VERSIONS_SHIFT)) & ENETC_VSI_SIRFSCAPR_VERSIONS_MASK)
/*! @} */

/*! @name TBMR - Tx BDR 0 mode register..Tx BDR 13 mode register */
/*! @{ */

#define ENETC_VSI_TBMR_PRIO_MASK                 (0x7U)
#define ENETC_VSI_TBMR_PRIO_SHIFT                (0U)
#define ENETC_VSI_TBMR_PRIO_WIDTH                (3U)
#define ENETC_VSI_TBMR_PRIO(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBMR_PRIO_SHIFT)) & ENETC_VSI_TBMR_PRIO_MASK)

#define ENETC_VSI_TBMR_WRR_MASK                  (0x70U)
#define ENETC_VSI_TBMR_WRR_SHIFT                 (4U)
#define ENETC_VSI_TBMR_WRR_WIDTH                 (3U)
#define ENETC_VSI_TBMR_WRR(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBMR_WRR_SHIFT)) & ENETC_VSI_TBMR_WRR_MASK)

#define ENETC_VSI_TBMR_CRC_MASK                  (0x100U)
#define ENETC_VSI_TBMR_CRC_SHIFT                 (8U)
#define ENETC_VSI_TBMR_CRC_WIDTH                 (1U)
#define ENETC_VSI_TBMR_CRC(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBMR_CRC_SHIFT)) & ENETC_VSI_TBMR_CRC_MASK)

#define ENETC_VSI_TBMR_VIH_MASK                  (0x200U)
#define ENETC_VSI_TBMR_VIH_SHIFT                 (9U)
#define ENETC_VSI_TBMR_VIH_WIDTH                 (1U)
#define ENETC_VSI_TBMR_VIH(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBMR_VIH_SHIFT)) & ENETC_VSI_TBMR_VIH_MASK)

#define ENETC_VSI_TBMR_FWB_MASK                  (0x1000000U)
#define ENETC_VSI_TBMR_FWB_SHIFT                 (24U)
#define ENETC_VSI_TBMR_FWB_WIDTH                 (1U)
#define ENETC_VSI_TBMR_FWB(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBMR_FWB_SHIFT)) & ENETC_VSI_TBMR_FWB_MASK)

#define ENETC_VSI_TBMR_EN_MASK                   (0x80000000U)
#define ENETC_VSI_TBMR_EN_SHIFT                  (31U)
#define ENETC_VSI_TBMR_EN_WIDTH                  (1U)
#define ENETC_VSI_TBMR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBMR_EN_SHIFT)) & ENETC_VSI_TBMR_EN_MASK)
/*! @} */

/*! @name TBSR - Tx BDR 0 status register..Tx BDR 13 status register */
/*! @{ */

#define ENETC_VSI_TBSR_BUSY_MASK                 (0x1U)
#define ENETC_VSI_TBSR_BUSY_SHIFT                (0U)
#define ENETC_VSI_TBSR_BUSY_WIDTH                (1U)
#define ENETC_VSI_TBSR_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBSR_BUSY_SHIFT)) & ENETC_VSI_TBSR_BUSY_MASK)

#define ENETC_VSI_TBSR_SBE_MASK                  (0x10000U)
#define ENETC_VSI_TBSR_SBE_SHIFT                 (16U)
#define ENETC_VSI_TBSR_SBE_WIDTH                 (1U)
#define ENETC_VSI_TBSR_SBE(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBSR_SBE_SHIFT)) & ENETC_VSI_TBSR_SBE_MASK)
/*! @} */

/*! @name TBBAR0 - Tx BDR 0 base address register 0..Tx BDR 13 base address register 0 */
/*! @{ */

#define ENETC_VSI_TBBAR0_ADDRL_MASK              (0xFFFFFF80U)
#define ENETC_VSI_TBBAR0_ADDRL_SHIFT             (7U)
#define ENETC_VSI_TBBAR0_ADDRL_WIDTH             (25U)
#define ENETC_VSI_TBBAR0_ADDRL(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBBAR0_ADDRL_SHIFT)) & ENETC_VSI_TBBAR0_ADDRL_MASK)
/*! @} */

/*! @name TBBAR1 - Tx BDR 0 base address register 1..Tx BDR 13 base address register 1 */
/*! @{ */

#define ENETC_VSI_TBBAR1_ADDRH_MASK              (0xFFFFFFFFU)
#define ENETC_VSI_TBBAR1_ADDRH_SHIFT             (0U)
#define ENETC_VSI_TBBAR1_ADDRH_WIDTH             (32U)
#define ENETC_VSI_TBBAR1_ADDRH(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBBAR1_ADDRH_SHIFT)) & ENETC_VSI_TBBAR1_ADDRH_MASK)
/*! @} */

/*! @name TBPIR - Tx BDR 0 producer index register..Tx BDR 13 producer index register */
/*! @{ */

#define ENETC_VSI_TBPIR_BDR_INDEX_MASK           (0xFFFFU)
#define ENETC_VSI_TBPIR_BDR_INDEX_SHIFT          (0U)
#define ENETC_VSI_TBPIR_BDR_INDEX_WIDTH          (16U)
#define ENETC_VSI_TBPIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBPIR_BDR_INDEX_SHIFT)) & ENETC_VSI_TBPIR_BDR_INDEX_MASK)
/*! @} */

