zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
/*! @name TBCIR - Tx BDR 0 consumer index register..Tx BDR 13 consumer index register */
/*! @{ */

#define ENETC_VSI_TBCIR_BDR_INDEX_MASK           (0xFFFFU)
#define ENETC_VSI_TBCIR_BDR_INDEX_SHIFT          (0U)
#define ENETC_VSI_TBCIR_BDR_INDEX_WIDTH          (16U)
#define ENETC_VSI_TBCIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBCIR_BDR_INDEX_SHIFT)) & ENETC_VSI_TBCIR_BDR_INDEX_MASK)

#define ENETC_VSI_TBCIR_STAT_ID_MASK             (0x7FFF0000U)
#define ENETC_VSI_TBCIR_STAT_ID_SHIFT            (16U)
#define ENETC_VSI_TBCIR_STAT_ID_WIDTH            (15U)
#define ENETC_VSI_TBCIR_STAT_ID(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBCIR_STAT_ID_SHIFT)) & ENETC_VSI_TBCIR_STAT_ID_MASK)

#define ENETC_VSI_TBCIR_SBE_MASK                 (0x80000000U)
#define ENETC_VSI_TBCIR_SBE_SHIFT                (31U)
#define ENETC_VSI_TBCIR_SBE_WIDTH                (1U)
#define ENETC_VSI_TBCIR_SBE(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBCIR_SBE_SHIFT)) & ENETC_VSI_TBCIR_SBE_MASK)
/*! @} */

/*! @name TBLENR - Tx BDR 0 length register..Tx BDR 13 length register */
/*! @{ */

#define ENETC_VSI_TBLENR_LENGTH_MASK             (0x1FFF8U)
#define ENETC_VSI_TBLENR_LENGTH_SHIFT            (3U)
#define ENETC_VSI_TBLENR_LENGTH_WIDTH            (14U)
#define ENETC_VSI_TBLENR_LENGTH(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBLENR_LENGTH_SHIFT)) & ENETC_VSI_TBLENR_LENGTH_MASK)
/*! @} */

/*! @name TBIER - Tx BDR 0 interrupt enable register..Tx BDR 13 interrupt enable register */
/*! @{ */

#define ENETC_VSI_TBIER_TXTIE_MASK               (0x1U)
#define ENETC_VSI_TBIER_TXTIE_SHIFT              (0U)
#define ENETC_VSI_TBIER_TXTIE_WIDTH              (1U)
#define ENETC_VSI_TBIER_TXTIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBIER_TXTIE_SHIFT)) & ENETC_VSI_TBIER_TXTIE_MASK)

#define ENETC_VSI_TBIER_TXFIE_MASK               (0x2U)
#define ENETC_VSI_TBIER_TXFIE_SHIFT              (1U)
#define ENETC_VSI_TBIER_TXFIE_WIDTH              (1U)
#define ENETC_VSI_TBIER_TXFIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBIER_TXFIE_SHIFT)) & ENETC_VSI_TBIER_TXFIE_MASK)
/*! @} */

/*! @name TBIDR - Tx BDR 0 interrupt detect register..Tx BDR 13 interrupt detect register */
/*! @{ */

#define ENETC_VSI_TBIDR_TXT_MASK                 (0x1U)
#define ENETC_VSI_TBIDR_TXT_SHIFT                (0U)
#define ENETC_VSI_TBIDR_TXT_WIDTH                (1U)
#define ENETC_VSI_TBIDR_TXT(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBIDR_TXT_SHIFT)) & ENETC_VSI_TBIDR_TXT_MASK)

#define ENETC_VSI_TBIDR_TXF_MASK                 (0x2U)
#define ENETC_VSI_TBIDR_TXF_SHIFT                (1U)
#define ENETC_VSI_TBIDR_TXF_WIDTH                (1U)
#define ENETC_VSI_TBIDR_TXF(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBIDR_TXF_SHIFT)) & ENETC_VSI_TBIDR_TXF_MASK)
/*! @} */

/*! @name TBICR0 - Tx BDR 0 interrupt coalescing register 0..Tx BDR 13 interrupt coalescing register 0 */
/*! @{ */

#define ENETC_VSI_TBICR0_ICPT_MASK               (0xFU)
#define ENETC_VSI_TBICR0_ICPT_SHIFT              (0U)
#define ENETC_VSI_TBICR0_ICPT_WIDTH              (4U)
#define ENETC_VSI_TBICR0_ICPT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBICR0_ICPT_SHIFT)) & ENETC_VSI_TBICR0_ICPT_MASK)

#define ENETC_VSI_TBICR0_ICEN_MASK               (0x80000000U)
#define ENETC_VSI_TBICR0_ICEN_SHIFT              (31U)
#define ENETC_VSI_TBICR0_ICEN_WIDTH              (1U)
#define ENETC_VSI_TBICR0_ICEN(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBICR0_ICEN_SHIFT)) & ENETC_VSI_TBICR0_ICEN_MASK)
/*! @} */

/*! @name TBICR1 - Tx BDR 0 interrupt coalescing register 1..Tx BDR 13 interrupt coalescing register 1 */
/*! @{ */

#define ENETC_VSI_TBICR1_ICTT_MASK               (0xFFFFFFFFU)
#define ENETC_VSI_TBICR1_ICTT_SHIFT              (0U)
#define ENETC_VSI_TBICR1_ICTT_WIDTH              (32U)
#define ENETC_VSI_TBICR1_ICTT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_TBICR1_ICTT_SHIFT)) & ENETC_VSI_TBICR1_ICTT_MASK)
/*! @} */

/*! @name RBMR - Rx BDR 0 mode register..Rx BDR 13 mode register */
/*! @{ */

#define ENETC_VSI_RBMR_AL_MASK                   (0x1U)
#define ENETC_VSI_RBMR_AL_SHIFT                  (0U)
#define ENETC_VSI_RBMR_AL_WIDTH                  (1U)
#define ENETC_VSI_RBMR_AL(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_AL_SHIFT)) & ENETC_VSI_RBMR_AL_MASK)

#define ENETC_VSI_RBMR_BDS_MASK                  (0x4U)
#define ENETC_VSI_RBMR_BDS_SHIFT                 (2U)
#define ENETC_VSI_RBMR_BDS_WIDTH                 (1U)
#define ENETC_VSI_RBMR_BDS(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_BDS_SHIFT)) & ENETC_VSI_RBMR_BDS_MASK)

#define ENETC_VSI_RBMR_CM_MASK                   (0x10U)
#define ENETC_VSI_RBMR_CM_SHIFT                  (4U)
#define ENETC_VSI_RBMR_CM_WIDTH                  (1U)
#define ENETC_VSI_RBMR_CM(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_CM_SHIFT)) & ENETC_VSI_RBMR_CM_MASK)

#define ENETC_VSI_RBMR_VTE_MASK                  (0x20U)
#define ENETC_VSI_RBMR_VTE_SHIFT                 (5U)
#define ENETC_VSI_RBMR_VTE_WIDTH                 (1U)
#define ENETC_VSI_RBMR_VTE(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_VTE_SHIFT)) & ENETC_VSI_RBMR_VTE_MASK)

#define ENETC_VSI_RBMR_VTPD_MASK                 (0x40U)
#define ENETC_VSI_RBMR_VTPD_SHIFT                (6U)
#define ENETC_VSI_RBMR_VTPD_WIDTH                (1U)
#define ENETC_VSI_RBMR_VTPD(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_VTPD_SHIFT)) & ENETC_VSI_RBMR_VTPD_MASK)

#define ENETC_VSI_RBMR_CRC_MASK                  (0x100U)
#define ENETC_VSI_RBMR_CRC_SHIFT                 (8U)
#define ENETC_VSI_RBMR_CRC_WIDTH                 (1U)
#define ENETC_VSI_RBMR_CRC(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_CRC_SHIFT)) & ENETC_VSI_RBMR_CRC_MASK)

#define ENETC_VSI_RBMR_EN_MASK                   (0x80000000U)
#define ENETC_VSI_RBMR_EN_SHIFT                  (31U)
#define ENETC_VSI_RBMR_EN_WIDTH                  (1U)
#define ENETC_VSI_RBMR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBMR_EN_SHIFT)) & ENETC_VSI_RBMR_EN_MASK)
/*! @} */

/*! @name RBSR - Rx BDR 0 status register..Rx BDR 13 status register */
/*! @{ */

#define ENETC_VSI_RBSR_EMPTY_MASK                (0x1U)
#define ENETC_VSI_RBSR_EMPTY_SHIFT               (0U)
#define ENETC_VSI_RBSR_EMPTY_WIDTH               (1U)
#define ENETC_VSI_RBSR_EMPTY(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBSR_EMPTY_SHIFT)) & ENETC_VSI_RBSR_EMPTY_MASK)

#define ENETC_VSI_RBSR_SBE_MASK                  (0x10000U)
#define ENETC_VSI_RBSR_SBE_SHIFT                 (16U)
#define ENETC_VSI_RBSR_SBE_WIDTH                 (1U)
#define ENETC_VSI_RBSR_SBE(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBSR_SBE_SHIFT)) & ENETC_VSI_RBSR_SBE_MASK)
/*! @} */

/*! @name RBBSR - Rx BDR 0 buffer size register..Rx BDR 13 buffer size register */
/*! @{ */

