zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_VSI.h
#define ENETC_VSI_RBBSR_BSIZE_MASK               (0xFFFFU)
#define ENETC_VSI_RBBSR_BSIZE_SHIFT              (0U)
#define ENETC_VSI_RBBSR_BSIZE_WIDTH              (16U)
#define ENETC_VSI_RBBSR_BSIZE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBBSR_BSIZE_SHIFT)) & ENETC_VSI_RBBSR_BSIZE_MASK)
/*! @} */

/*! @name RBCIR - Rx BDR 0 consumer index register..Rx BDR 13 consumer index register */
/*! @{ */

#define ENETC_VSI_RBCIR_BDR_INDEX_MASK           (0xFFFFU)
#define ENETC_VSI_RBCIR_BDR_INDEX_SHIFT          (0U)
#define ENETC_VSI_RBCIR_BDR_INDEX_WIDTH          (16U)
#define ENETC_VSI_RBCIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBCIR_BDR_INDEX_SHIFT)) & ENETC_VSI_RBCIR_BDR_INDEX_MASK)
/*! @} */

/*! @name RBBAR0 - Rx BDR 0 base address register 0..Rx BDR 13 base address register 0 */
/*! @{ */

#define ENETC_VSI_RBBAR0_ADDRL_MASK              (0xFFFFFF80U)
#define ENETC_VSI_RBBAR0_ADDRL_SHIFT             (7U)
#define ENETC_VSI_RBBAR0_ADDRL_WIDTH             (25U)
#define ENETC_VSI_RBBAR0_ADDRL(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBBAR0_ADDRL_SHIFT)) & ENETC_VSI_RBBAR0_ADDRL_MASK)
/*! @} */

/*! @name RBBAR1 - Rx BDR 0 base address register 1..Rx BDR 13 base address register 1 */
/*! @{ */

#define ENETC_VSI_RBBAR1_ADDRH_MASK              (0xFFFFFFFFU)
#define ENETC_VSI_RBBAR1_ADDRH_SHIFT             (0U)
#define ENETC_VSI_RBBAR1_ADDRH_WIDTH             (32U)
#define ENETC_VSI_RBBAR1_ADDRH(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBBAR1_ADDRH_SHIFT)) & ENETC_VSI_RBBAR1_ADDRH_MASK)
/*! @} */

/*! @name RBPIR - Rx BDR 0 producer index register..Rx BDR 13 producer index register */
/*! @{ */

#define ENETC_VSI_RBPIR_BDR_INDEX_MASK           (0xFFFFU)
#define ENETC_VSI_RBPIR_BDR_INDEX_SHIFT          (0U)
#define ENETC_VSI_RBPIR_BDR_INDEX_WIDTH          (16U)
#define ENETC_VSI_RBPIR_BDR_INDEX(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBPIR_BDR_INDEX_SHIFT)) & ENETC_VSI_RBPIR_BDR_INDEX_MASK)

#define ENETC_VSI_RBPIR_SBE_MASK                 (0x80000000U)
#define ENETC_VSI_RBPIR_SBE_SHIFT                (31U)
#define ENETC_VSI_RBPIR_SBE_WIDTH                (1U)
#define ENETC_VSI_RBPIR_SBE(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBPIR_SBE_SHIFT)) & ENETC_VSI_RBPIR_SBE_MASK)
/*! @} */

/*! @name RBLENR - Rx BDR 0 length register..Rx BDR 13 length register */
/*! @{ */

#define ENETC_VSI_RBLENR_LENGTH_MASK             (0x1FFF8U)
#define ENETC_VSI_RBLENR_LENGTH_SHIFT            (3U)
#define ENETC_VSI_RBLENR_LENGTH_WIDTH            (14U)
#define ENETC_VSI_RBLENR_LENGTH(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBLENR_LENGTH_SHIFT)) & ENETC_VSI_RBLENR_LENGTH_MASK)
/*! @} */

/*! @name RBDCR - Rx BDR 0 drop count register..Rx BDR 13 drop count register */
/*! @{ */

#define ENETC_VSI_RBDCR_COUNT_MASK               (0xFFFFFFFFU)
#define ENETC_VSI_RBDCR_COUNT_SHIFT              (0U)
#define ENETC_VSI_RBDCR_COUNT_WIDTH              (32U)
#define ENETC_VSI_RBDCR_COUNT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBDCR_COUNT_SHIFT)) & ENETC_VSI_RBDCR_COUNT_MASK)
/*! @} */

/*! @name RBIER - Rx BDR 0 interrupt enable register..Rx BDR 13 interrupt enable register */
/*! @{ */

#define ENETC_VSI_RBIER_RXTIE_MASK               (0x1U)
#define ENETC_VSI_RBIER_RXTIE_SHIFT              (0U)
#define ENETC_VSI_RBIER_RXTIE_WIDTH              (1U)
#define ENETC_VSI_RBIER_RXTIE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBIER_RXTIE_SHIFT)) & ENETC_VSI_RBIER_RXTIE_MASK)
/*! @} */

/*! @name RBIDR - Rx BDR 0 interrupt detect register..Rx BDR 13 interrupt detect register */
/*! @{ */

#define ENETC_VSI_RBIDR_RXT_MASK                 (0x1U)
#define ENETC_VSI_RBIDR_RXT_SHIFT                (0U)
#define ENETC_VSI_RBIDR_RXT_WIDTH                (1U)
#define ENETC_VSI_RBIDR_RXT(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBIDR_RXT_SHIFT)) & ENETC_VSI_RBIDR_RXT_MASK)
/*! @} */

/*! @name RBICR0 - Rx BDR 0 interrupt coalescing register 0..Rx BDR 13 interrupt coalescing register 0 */
/*! @{ */

#define ENETC_VSI_RBICR0_ICPT_MASK               (0x1FFU)
#define ENETC_VSI_RBICR0_ICPT_SHIFT              (0U)
#define ENETC_VSI_RBICR0_ICPT_WIDTH              (9U)
#define ENETC_VSI_RBICR0_ICPT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBICR0_ICPT_SHIFT)) & ENETC_VSI_RBICR0_ICPT_MASK)

#define ENETC_VSI_RBICR0_ICEN_MASK               (0x80000000U)
#define ENETC_VSI_RBICR0_ICEN_SHIFT              (31U)
#define ENETC_VSI_RBICR0_ICEN_WIDTH              (1U)
#define ENETC_VSI_RBICR0_ICEN(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBICR0_ICEN_SHIFT)) & ENETC_VSI_RBICR0_ICEN_MASK)
/*! @} */

/*! @name RBICR1 - Rx BDR 0 interrupt coalescing register 1..Rx BDR 13 interrupt coalescing register 1 */
/*! @{ */

#define ENETC_VSI_RBICR1_ICTT_MASK               (0xFFFFFFFFU)
#define ENETC_VSI_RBICR1_ICTT_SHIFT              (0U)
#define ENETC_VSI_RBICR1_ICTT_WIDTH              (32U)
#define ENETC_VSI_RBICR1_ICTT(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_VSI_RBICR1_ICTT_SHIFT)) & ENETC_VSI_RBICR1_ICTT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_VSI_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_VSI_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_VSI_H_) */
